/**
 * Created by tom on 2017/5/9.
 */
define(function (require, exports, module) {
    var data = [
            {
                text: '请选择',
                id: -1
            },
            {
                text: '北京',
                id: '11',
                state: [
                    {
                        text: '北京市',
                        id: '01',
                        city: [
                            {text: '东城区', id: '01'},
                            {text: '西城区', id: '02'},
                            {text: '崇文区', id: '03'},
                            {text: '宣武区', id: '04'},
                            {text: '朝阳区', id: '05'},
                            {text: '丰台区', id: '06'},
                            {text: '石景山区', id: '07'},
                            {text: '海淀区', id: '08'},
                            {text: '门头沟区', id: '09'},
                            {text: '房山区', id: '11'},
                            {text: '通州区', id: '12'},
                            {text: '顺义区', id: '13'},
                            {text: '昌平区', id: '14'},
                            {text: '大兴区', id: '15'},
                            {text: '怀柔区', id: '16'},
                            {text: '平谷区', id: '17'},
                            {text: '密云县', id: '28'},
                            {text: '延庆县', id: '29'}
                        ]
                    }
                ]
            },
            {

                text: '天津',
                id: '12',
                state: [
                    {
                        text: '天津市',
                        id: '01',
                        city: [
                            {text: '和平区', id: '01'},
                            {text: '河东区', id: '02'},
                            {text: '河西区', id: '03'},
                            {text: '南开区', id: '04'},
                            {text: '河北区', id: '05'},
                            {text: '红桥区', id: '06'},
                            {text: '塘沽区', id: '07'},
                            {text: '汉沽区', id: '08'},
                            {text: '大港区', id: '09'},
                            {text: '东丽区', id: '10'},
                            {text: '西青区', id: '11'},
                            {text: '津南区', id: '12'},
                            {text: '北辰区', id: '13'},
                            {text: '武清区', id: '14'},
                            {text: '宝坻区', id: '15'},
                            {text: '宁河县', id: '21'},
                            {text: '静海县', id: '23'},
                            {text: '蓟县', id: '25'}
                        ]
                    }
                ]

            },
            {

                text: '河北省',
                id: '13',
                state: [
                    {
                        text: '石家庄市',
                        id: '01',
                        city: [
                            {text: '长安区', id: '02'},
                            {text: '桥东区', id: '03'},
                            {text: '桥西区', id: '04'},
                            {text: '新华区', id: '05'},
                            {text: '井陉矿区', id: '07'},
                            {text: '裕华区', id: '08'},
                            {text: '井陉县', id: '21'},
                            {text: '正定县', id: '23'},
                            {text: '栾城县', id: '24'},
                            {text: '行唐县', id: '25'},
                            {text: '灵寿县', id: '26'},
                            {text: '高邑县', id: '27'},
                            {text: '深泽县', id: '28'},
                            {text: '赞皇县', id: '29'},
                            {text: '无极县', id: '30'},
                            {text: '平山县', id: '31'},
                            {text: '元氏县', id: '32'},
                            {text: '赵县', id: '33'},
                            {text: '辛集市', id: '81'},
                            {text: '藁城市', id: '82'},
                            {text: '晋州市', id: '83'},
                            {text: '新乐市', id: '84'},
                            {text: '鹿泉市', id: '85'}
                        ]
                    },
                    {
                        text: '唐山市',
                        id: '02',
                        city: [
                            {text: '路南区', id: '02'},
                            {text: '路北区', id: '03'},
                            {text: '古冶区', id: '04'},
                            {text: '开平区', id: '05'},
                            {text: '丰南区', id: '07'},
                            {text: '丰润区', id: '08'},
                            {text: '滦县', id: '23'},
                            {text: '滦南县', id: '24'},
                            {text: '乐亭县', id: '25'},
                            {text: '迁西县', id: '27'},
                            {text: '玉田县', id: '29'},
                            {text: '唐海县', id: '30'},
                            {text: '遵化市', id: '81'},
                            {text: '迁安市', id: '83'}
                        ]
                    },
                    {
                        text: '秦皇岛市',
                        id: '03',
                        city: [
                            {text: '海港区', id: '02'},
                            {text: '山海关区', id: '03'},
                            {text: '北戴河区', id: '04'},
                            {text: '青龙满族自治县', id: '21'},
                            {text: '昌黎县', id: '22'},
                            {text: '抚宁县', id: '23'},
                            {text: '卢龙县', id: '24'}
                        ]
                    },
                    {
                        text: '邯郸市',
                        id: '04',
                        city: [
                            {text: '邯山区', id: '02'},
                            {text: '丛台区', id: '03'},
                            {text: '复兴区', id: '04'},
                            {text: '峰峰矿区', id: '06'},
                            {text: '邯郸县', id: '21'},
                            {text: '临漳县', id: '23'},
                            {text: '成安县', id: '24'},
                            {text: '大名县', id: '25'},
                            {text: '涉县', id: '26'},
                            {text: '磁县', id: '27'},
                            {text: '肥乡县', id: '28'},
                            {text: '永年县', id: '29'},
                            {text: '邱县', id: '30'},
                            {text: '鸡泽县', id: '31'},
                            {text: '广平县', id: '32'},
                            {text: '馆陶县', id: '33'},
                            {text: '魏县', id: '34'},
                            {text: '曲周县', id: '35'},
                            {text: '武安市', id: '81'}
                        ]
                    },
                    {
                        text: '邢台市',
                        id: '05',
                        city: [
                            {text: '桥东区', id: '02'},
                            {text: '桥西区', id: '03'},
                            {text: '邢台县', id: '21'},
                            {text: '临城县', id: '22'},
                            {text: '内丘县', id: '23'},
                            {text: '柏乡县', id: '24'},
                            {text: '隆尧县', id: '25'},
                            {text: '任县', id: '26'},
                            {text: '南和县', id: '27'},
                            {text: '宁晋县', id: '28'},
                            {text: '巨鹿县', id: '29'},
                            {text: '新河县', id: '30'},
                            {text: '广宗县', id: '31'},
                            {text: '平乡县', id: '32'},
                            {text: '威县', id: '33'},
                            {text: '清河县', id: '34'},
                            {text: '临西县', id: '35'},
                            {text: '南宫市', id: '81'},
                            {text: '沙河市', id: '82'}
                        ]
                    },
                    {
                        text: '保定市',
                        id: '06',
                        city: [
                            {text: '新市区', id: '02'},
                            {text: '北市区', id: '03'},
                            {text: '南市区', id: '04'},
                            {text: '满城县', id: '21'},
                            {text: '清苑县', id: '22'},
                            {text: '涞水县', id: '23'},
                            {text: '阜平县', id: '24'},
                            {text: '徐水县', id: '25'},
                            {text: '定兴县', id: '26'},
                            {text: '唐县', id: '27'},
                            {text: '高阳县', id: '28'},
                            {text: '容城县', id: '29'},
                            {text: '涞源县', id: '30'},
                            {text: '望都县', id: '31'},
                            {text: '安新县', id: '32'},
                            {text: '易县', id: '33'},
                            {text: '曲阳县', id: '34'},
                            {text: '蠡县', id: '35'},
                            {text: '顺平县', id: '36'},
                            {text: '博野县', id: '37'},
                            {text: '雄县', id: '38'},
                            {text: '涿州市', id: '81'},
                            {text: '定州市', id: '82'},
                            {text: '安国市', id: '83'},
                            {text: '高碑店市', id: '84'}
                        ]
                    },
                    {
                        text: '张家口市',
                        id: '07',
                        city: [
                            {text: '桥东区', id: '02'},
                            {text: '桥西区', id: '03'},
                            {text: '宣化区', id: '05'},
                            {text: '下花园区', id: '06'},
                            {text: '宣化县', id: '21'},
                            {text: '张北县', id: '22'},
                            {text: '康保县', id: '23'},
                            {text: '沽源县', id: '24'},
                            {text: '尚义县', id: '25'},
                            {text: '蔚县', id: '26'},
                            {text: '阳原县', id: '27'},
                            {text: '怀安县', id: '28'},
                            {text: '万全县', id: '29'},
                            {text: '怀来县', id: '30'},
                            {text: '涿鹿县', id: '31'},
                            {text: '赤城县', id: '32'},
                            {text: '崇礼县', id: '33'}
                        ]
                    },
                    {
                        text: '承德市',
                        id: '08',
                        city: [
                            {text: '双桥区', id: '02'},
                            {text: '双滦区', id: '03'},
                            {text: '鹰手营子矿区', id: '04'},
                            {text: '承德县', id: '21'},
                            {text: '兴隆县', id: '22'},
                            {text: '平泉县', id: '23'},
                            {text: '滦平县', id: '24'},
                            {text: '隆化县', id: '25'},
                            {text: '丰宁满族自治县', id: '26'},
                            {text: '宽城满族自治县', id: '27'},
                            {text: '围场满族蒙古族自治县', id: '28'}
                        ]
                    },
                    {
                        text: '沧州市',
                        id: '09',
                        city: [
                            {text: '新华区', id: '02'},
                            {text: '运河区', id: '03'},
                            {text: '沧县', id: '21'},
                            {text: '青县', id: '22'},
                            {text: '东光县', id: '23'},
                            {text: '海兴县', id: '24'},
                            {text: '盐山县', id: '25'},
                            {text: '肃宁县', id: '26'},
                            {text: '南皮县', id: '27'},
                            {text: '吴桥县', id: '28'},
                            {text: '献县', id: '29'},
                            {text: '孟村回族自治县', id: '30'},
                            {text: '泊头市', id: '81'},
                            {text: '任丘市', id: '82'},
                            {text: '黄骅市', id: '83'},
                            {text: '河间市', id: '84'}
                        ]
                    },
                    {
                        text: '廊坊市',
                        id: '10',
                        city: [
                            {text: '安次区', id: '02'},
                            {text: '广阳区', id: '03'},
                            {text: '固安县', id: '22'},
                            {text: '永清县', id: '23'},
                            {text: '香河县', id: '24'},
                            {text: '大城县', id: '25'},
                            {text: '文安县', id: '26'},
                            {text: '大厂回族自治县', id: '28'},
                            {text: '霸州市', id: '81'},
                            {text: '三河市', id: '82'}
                        ]
                    },
                    {
                        text: '衡水市',
                        id: '11',
                        city: [
                            {text: '桃城区', id: '02'},
                            {text: '枣强县', id: '21'},
                            {text: '武邑县', id: '22'},
                            {text: '武强县', id: '23'},
                            {text: '饶阳县', id: '24'},
                            {text: '安平县', id: '25'},
                            {text: '故城县', id: '26'},
                            {text: '景县', id: '27'},
                            {text: '阜城县', id: '28'},
                            {text: '冀州市', id: '81'},
                            {text: '深州市', id: '82'}
                        ]
                    }
                ]

            },
            {

                text: '山西省',
                id: '14',
                state: [
                    {
                        text: '太原市',
                        id: '01',
                        city: [
                            {text: '小店区', id: '05'},
                            {text: '迎泽区', id: '06'},
                            {text: '杏花岭区', id: '07'},
                            {text: '尖草坪区', id: '08'},
                            {text: '万柏林区', id: '09'},
                            {text: '晋源区', id: '10'},
                            {text: '清徐县', id: '21'},
                            {text: '阳曲县', id: '22'},
                            {text: '娄烦县', id: '23'},
                            {text: '古交市', id: '81'}
                        ]
                    },
                    {
                        text: '大同市',
                        id: '02',
                        city: [
                            {text: '城区', id: '02'},
                            {text: '矿区', id: '03'},
                            {text: '南郊区', id: '11'},
                            {text: '新荣区', id: '12'},
                            {text: '阳高县', id: '21'},
                            {text: '天镇县', id: '22'},
                            {text: '广灵县', id: '23'},
                            {text: '灵丘县', id: '24'},
                            {text: '浑源县', id: '25'},
                            {text: '左云县', id: '26'},
                            {text: '大同县', id: '27'}
                        ]
                    },
                    {
                        text: '阳泉市',
                        id: '03',
                        city: [
                            {text: '城区', id: '02'},
                            {text: '矿区', id: '03'},
                            {text: '郊区', id: '11'},
                            {text: '平定县', id: '21'},
                            {text: '盂县', id: '22'}
                        ]
                    },
                    {
                        text: '长治市',
                        id: '04',
                        city: [
                            {text: '城区', id: '02'},
                            {text: '郊区', id: '11'},
                            {text: '长治县', id: '21'},
                            {text: '襄垣县', id: '23'},
                            {text: '屯留县', id: '24'},
                            {text: '平顺县', id: '25'},
                            {text: '黎城县', id: '26'},
                            {text: '壶关县', id: '27'},
                            {text: '长子县', id: '28'},
                            {text: '武乡县', id: '29'},
                            {text: '沁县', id: '30'},
                            {text: '沁源县', id: '31'},
                            {text: '潞城市', id: '81'}
                        ]
                    },
                    {
                        text: '晋城市',
                        id: '05',
                        city: [
                            {text: '城区', id: '02'},
                            {text: '沁水县', id: '21'},
                            {text: '阳城县', id: '22'},
                            {text: '陵川县', id: '24'},
                            {text: '泽州县', id: '25'},
                            {text: '高平市', id: '81'}
                        ]
                    },
                    {
                        text: '朔州市',
                        id: '06',
                        city: [
                            {text: '朔城区', id: '02'},
                            {text: '平鲁区', id: '03'},
                            {text: '山阴县', id: '21'},
                            {text: '应县', id: '22'},
                            {text: '右玉县', id: '23'},
                            {text: '怀仁县', id: '24'}
                        ]
                    },
                    {
                        text: '晋中市',
                        id: '07',
                        city: [
                            {text: '榆次区', id: '02'},
                            {text: '榆社县', id: '21'},
                            {text: '左权县', id: '22'},
                            {text: '和顺县', id: '23'},
                            {text: '昔阳县', id: '24'},
                            {text: '寿阳县', id: '25'},
                            {text: '太谷县', id: '26'},
                            {text: '祁县', id: '27'},
                            {text: '平遥县', id: '28'},
                            {text: '灵石县', id: '29'},
                            {text: '介休市', id: '81'}
                        ]
                    },
                    {
                        text: '运城市',
                        id: '08',
                        city: [
                            {text: '盐湖区', id: '02'},
                            {text: '临猗县', id: '21'},
                            {text: '万荣县', id: '22'},
                            {text: '闻喜县', id: '23'},
                            {text: '稷山县', id: '24'},
                            {text: '新绛县', id: '25'},
                            {text: '绛县', id: '26'},
                            {text: '垣曲县', id: '27'},
                            {text: '夏县', id: '28'},
                            {text: '平陆县', id: '29'},
                            {text: '芮城县', id: '30'},
                            {text: '永济市', id: '81'},
                            {text: '河津市', id: '82'}
                        ]
                    },
                    {
                        text: '忻州市',
                        id: '09',
                        city: [
                            {text: '忻府区', id: '02'},
                            {text: '定襄县', id: '21'},
                            {text: '五台县', id: '22'},
                            {text: '代县', id: '23'},
                            {text: '繁峙县', id: '24'},
                            {text: '宁武县', id: '25'},
                            {text: '静乐县', id: '26'},
                            {text: '神池县', id: '27'},
                            {text: '五寨县', id: '28'},
                            {text: '岢岚县', id: '29'},
                            {text: '河曲县', id: '30'},
                            {text: '保德县', id: '31'},
                            {text: '偏关县', id: '32'},
                            {text: '原平市', id: '81'}
                        ]
                    },
                    {
                        text: '临汾市',
                        id: '10',
                        city: [
                            {text: '尧都区', id: '02'},
                            {text: '曲沃县', id: '21'},
                            {text: '翼城县', id: '22'},
                            {text: '襄汾县', id: '23'},
                            {text: '洪洞县', id: '24'},
                            {text: '古县', id: '25'},
                            {text: '安泽县', id: '26'},
                            {text: '浮山县', id: '27'},
                            {text: '吉县', id: '28'},
                            {text: '乡宁县', id: '29'},
                            {text: '大宁县', id: '30'},
                            {text: '隰县', id: '31'},
                            {text: '永和县', id: '32'},
                            {text: '蒲县', id: '33'},
                            {text: '汾西县', id: '34'},
                            {text: '侯马市', id: '81'},
                            {text: '霍州市', id: '82'}
                        ]
                    },
                    {
                        text: '吕梁市',
                        id: '11',
                        city: [
                            {text: '离石区', id: '02'},
                            {text: '文水县', id: '21'},
                            {text: '交城县', id: '22'},
                            {text: '兴县', id: '23'},
                            {text: '临县', id: '24'},
                            {text: '柳林县', id: '25'},
                            {text: '石楼县', id: '26'},
                            {text: '岚县', id: '27'},
                            {text: '方山县', id: '28'},
                            {text: '中阳县', id: '29'},
                            {text: '交口县', id: '30'},
                            {text: '孝义市', id: '81'},
                            {text: '汾阳市', id: '82'}
                        ]
                    }
                ]

            },
            {

                text: '内蒙古',
                id: '15',
                state: [
                    {
                        text: '呼和浩特市',
                        id: '01',
                        city: [
                            {text: '新城区', id: '02'},
                            {text: '回民区', id: '03'},
                            {text: '玉泉区', id: '04'},
                            {text: '赛罕区', id: '05'},
                            {text: '土默特左旗', id: '21'},
                            {text: '托克托县', id: '22'},
                            {text: '和林格尔县', id: '23'},
                            {text: '清水河县', id: '24'},
                            {text: '武川县', id: '25'}
                        ]
                    },
                    {
                        text: '包头市',
                        id: '02',
                        city: [
                            {text: '东河区', id: '02'},
                            {text: '昆都仑区', id: '03'},
                            {text: '青山区', id: '04'},
                            {text: '石拐区', id: '05'},
                            {text: '白云矿区', id: '06'},
                            {text: '九原区', id: '07'},
                            {text: '土默特右旗', id: '21'},
                            {text: '固阳县', id: '22'},
                            {text: '达尔罕茂明安联合旗', id: '23'}
                        ]
                    },
                    {
                        text: '乌海市',
                        id: '03',
                        city: [
                            {text: '海勃湾区', id: '02'},
                            {text: '海南区', id: '03'},
                            {text: '乌达区', id: '04'}
                        ]
                    },
                    {
                        text: '赤峰市',
                        id: '04',
                        city: [
                            {text: '红山区', id: '02'},
                            {text: '元宝山区', id: '03'},
                            {text: '松山区', id: '04'},
                            {text: '阿鲁科尔沁旗', id: '21'},
                            {text: '巴林左旗', id: '22'},
                            {text: '巴林右旗', id: '23'},
                            {text: '林西县', id: '24'},
                            {text: '克什克腾旗', id: '25'},
                            {text: '翁牛特旗', id: '26'},
                            {text: '喀喇沁旗', id: '28'},
                            {text: '宁城县', id: '29'},
                            {text: '敖汉旗', id: '30'}
                        ]
                    },
                    {
                        text: '通辽市',
                        id: '05',
                        city: [
                            {text: '科尔沁区', id: '02'},
                            {text: '科尔沁左翼中旗', id: '21'},
                            {text: '科尔沁左翼后旗', id: '22'},
                            {text: '开鲁县', id: '23'},
                            {text: '库伦旗', id: '24'},
                            {text: '奈曼旗', id: '25'},
                            {text: '扎鲁特旗', id: '26'},
                            {text: '霍林郭勒市', id: '81'}
                        ]
                    },
                    {
                        text: '鄂尔多斯市',
                        id: '06',
                        city: [
                            {text: '东胜区', id: '02'},
                            {text: '达拉特旗', id: '21'},
                            {text: '准格尔旗', id: '22'},
                            {text: '鄂托克前旗', id: '23'},
                            {text: '鄂托克旗', id: '24'},
                            {text: '杭锦旗', id: '25'},
                            {text: '乌审旗', id: '26'},
                            {text: '伊金霍洛旗', id: '27'}
                        ]
                    },
                    {
                        text: '呼伦贝尔市',
                        id: '07',
                        city: [
                            {text: '海拉尔区', id: '02'},
                            {text: '阿荣旗', id: '21'},
                            {text: '莫力达瓦达斡尔族自治旗', id: '22'},
                            {text: '鄂伦春自治旗', id: '23'},
                            {text: '鄂温克族自治旗', id: '24'},
                            {text: '陈巴尔虎旗', id: '25'},
                            {text: '新巴尔虎左旗', id: '26'},
                            {text: '新巴尔虎右旗', id: '27'},
                            {text: '满洲里市', id: '81'},
                            {text: '牙克石市', id: '82'},
                            {text: '扎兰屯市', id: '83'},
                            {text: '额尔古纳市', id: '84'},
                            {text: '根河市', id: '85'}
                        ]
                    },
                    {
                        text: '巴彦淖尔市',
                        id: '08',
                        city: [
                            {text: '临河区', id: '02'},
                            {text: '五原县', id: '21'},
                            {text: '磴口县', id: '22'},
                            {text: '乌拉特前旗', id: '23'},
                            {text: '乌拉特中旗', id: '24'},
                            {text: '乌拉特后旗', id: '25'},
                            {text: '杭锦后旗', id: '26'}
                        ]
                    },
                    {
                        text: '乌兰察布市',
                        id: '09',
                        city: [
                            {text: '集宁区', id: '02'},
                            {text: '卓资县', id: '21'},
                            {text: '化德县', id: '22'},
                            {text: '商都县', id: '23'},
                            {text: '兴和县', id: '24'},
                            {text: '凉城县', id: '25'},
                            {text: '察哈尔右翼前旗', id: '26'},
                            {text: '察哈尔右翼中旗', id: '27'},
                            {text: '察哈尔右翼后旗', id: '28'},
                            {text: '四子王旗', id: '29'},
                            {text: '丰镇市', id: '81'}
                        ]
                    },
                    {
                        text: '兴安盟',
                        id: '22',
                        city: [
                            {text: '乌兰浩特市', id: '01'},
                            {text: '阿尔山市', id: '02'},
                            {text: '科尔沁右翼前旗', id: '21'},
                            {text: '科尔沁右翼中旗', id: '22'},
                            {text: '扎赉特旗', id: '23'},
                            {text: '突泉县', id: '24'}
                        ]
                    },
                    {
                        text: '锡林郭勒盟',
                        id: '25',
                        city: [
                            {text: '二连浩特市', id: '01'},
                            {text: '锡林浩特市', id: '02'},
                            {text: '阿巴嘎旗', id: '22'},
                            {text: '苏尼特左旗', id: '23'},
                            {text: '苏尼特右旗', id: '24'},
                            {text: '东乌珠穆沁旗', id: '25'},
                            {text: '西乌珠穆沁旗', id: '26'},
                            {text: '太仆寺旗', id: '27'},
                            {text: '镶黄旗', id: '28'},
                            {text: '正镶白旗', id: '29'},
                            {text: '正蓝旗', id: '30'},
                            {text: '多伦县', id: '31'}
                        ]
                    },
                    {
                        text: '阿拉善盟',
                        id: '29',
                        city: [
                            {text: '阿拉善左旗', id: '21'},
                            {text: '阿拉善右旗', id: '22'},
                            {text: '额济纳旗', id: '23'}
                        ]
                    }
                ]

            },
            {

                text: '辽宁省',
                id: '21',
                state: [
                    {
                        text: '沈阳市',
                        id: '01',
                        city: [
                            {text: '和平区', id: '02'},
                            {text: '沈河区', id: '03'},
                            {text: '大东区', id: '04'},
                            {text: '皇姑区', id: '05'},
                            {text: '铁西区', id: '06'},
                            {text: '苏家屯区', id: '11'},
                            {text: '东陵区', id: '12'},
                            {text: '沈北新区', id: '13'},
                            {text: '于洪区', id: '14'},
                            {text: '辽中县', id: '22'},
                            {text: '康平县', id: '23'},
                            {text: '法库县', id: '24'},
                            {text: '新民市', id: '81'}
                        ]
                    },
                    {
                        text: '大连市',
                        id: '02',
                        city: [
                            {text: '中山区', id: '02'},
                            {text: '西岗区', id: '03'},
                            {text: '沙河口区', id: '04'},
                            {text: '甘井子区', id: '11'},
                            {text: '旅顺口区', id: '12'},
                            {text: '金州区', id: '13'},
                            {text: '长海县', id: '24'},
                            {text: '瓦房店市', id: '81'},
                            {text: '普兰店市', id: '82'},
                            {text: '庄河市', id: '83'}
                        ]
                    },
                    {
                        text: '鞍山市',
                        id: '03',
                        city: [
                            {text: '铁东区', id: '02'},
                            {text: '铁西区', id: '03'},
                            {text: '立山区', id: '04'},
                            {text: '千山区', id: '11'},
                            {text: '台安县', id: '21'},
                            {text: '岫岩满族自治县', id: '23'},
                            {text: '海城市', id: '81'}
                        ]
                    },
                    {
                        text: '抚顺市',
                        id: '04',
                        city: [
                            {text: '新抚区', id: '02'},
                            {text: '东洲区', id: '03'},
                            {text: '望花区', id: '04'},
                            {text: '顺城区', id: '11'},
                            {text: '抚顺县', id: '21'},
                            {text: '新宾满族自治县', id: '23'},
                            {text: '清原满族自治县', id: '23'}
                        ]
                    },
                    {
                        text: '本溪市',
                        id: '05',
                        city: [
                            {text: '平山区', id: '02'},
                            {text: '溪湖区', id: '03'},
                            {text: '明山区', id: '04'},
                            {text: '南芬区', id: '05'},
                            {text: '本溪满族自治县', id: '21'},
                            {text: '桓仁满族自治县', id: '22'}
                        ]
                    },
                    {
                        text: '丹东市',
                        id: '06',
                        city: [
                            {text: '元宝区', id: '02'},
                            {text: '振兴区', id: '03'},
                            {text: '振安区', id: '04'},
                            {text: '宽甸满族自治县', id: '24'},
                            {text: '东港市', id: '81'},
                            {text: '凤城市', id: '82'}
                        ]
                    },
                    {
                        text: '锦州市',
                        id: '07',
                        city: [
                            {text: '古塔区', id: '02'},
                            {text: '凌河区', id: '03'},
                            {text: '太和区', id: '11'},
                            {text: '黑山县', id: '26'},
                            {text: '义县', id: '27'},
                            {text: '凌海市', id: '81'},
                            {text: '北镇市', id: '82'}
                        ]
                    },
                    {
                        text: '营口市',
                        id: '08',
                        city: [
                            {text: '站前区', id: '02'},
                            {text: '西市区', id: '03'},
                            {text: '鲅鱼圈区', id: '04'},
                            {text: '老边区', id: '11'},
                            {text: '盖州市', id: '81'},
                            {text: '大石桥市', id: '82'}
                        ]
                    },
                    {
                        text: '阜新市',
                        id: '09',
                        city: [
                            {text: '海州区', id: '02'},
                            {text: '新邱区', id: '03'},
                            {text: '太平区', id: '04'},
                            {text: '清河门区', id: '05'},
                            {text: '细河区', id: '11'},
                            {text: '阜新蒙古族自治县', id: '21'},
                            {text: '彰武县', id: '22'}
                        ]
                    },
                    {
                        text: '辽阳市',
                        id: '10',
                        city: [
                            {text: '白塔区', id: '02'},
                            {text: '文圣区', id: '03'},
                            {text: '宏伟区', id: '04'},
                            {text: '弓长岭区', id: '05'},
                            {text: '太子河区', id: '11'},
                            {text: '辽阳县', id: '21'},
                            {text: '灯塔市', id: '81'}
                        ]
                    },
                    {
                        text: '盘锦市',
                        id: '11',
                        city: [
                            {text: '双台子区', id: '02'},
                            {text: '兴隆台区', id: '03'},
                            {text: '大洼县', id: '21'},
                            {text: '盘山县', id: '22'}
                        ]
                    },
                    {
                        text: '铁岭市',
                        id: '12',
                        city: [
                            {text: '银州区', id: '02'},
                            {text: '清河区', id: '04'},
                            {text: '铁岭县', id: '21'},
                            {text: '西丰县', id: '23'},
                            {text: '昌图县', id: '24'},
                            {text: '调兵山市', id: '81'},
                            {text: '开原市', id: '82'}
                        ]
                    },
                    {
                        text: '朝阳市',
                        id: '13',
                        city: [
                            {text: '双塔区', id: '02'},
                            {text: '龙城区', id: '03'},
                            {text: '朝阳县', id: '21'},
                            {text: '建平县', id: '22'},
                            {text: '喀喇沁左翼蒙古族自治县', id: '24'},
                            {text: '北票市', id: '81'},
                            {text: '凌源市', id: '82'}
                        ]
                    },
                    {
                        text: '葫芦岛市',
                        id: '14',
                        city: [
                            {text: '连山区', id: '02'},
                            {text: '龙港区', id: '03'},
                            {text: '南票区', id: '04'},
                            {text: '绥中县', id: '21'},
                            {text: '建昌县', id: '22'},
                            {text: '兴城市', id: '81'}
                        ]
                    }
                ]

            },
            {

                text: '吉林省',
                id: '22',
                state: [
                    {
                        text: '长春市',
                        id: '01',
                        city: [
                            {text: '南关区', id: '02'},
                            {text: '宽城区', id: '03'},
                            {text: '朝阳区', id: '04'},
                            {text: '二道区', id: '05'},
                            {text: '绿园区', id: '06'},
                            {text: '双阳区', id: '12'},
                            {text: '农安县', id: '22'},
                            {text: '九台市', id: '81'},
                            {text: '榆树市', id: '82'},
                            {text: '德惠市', id: '83'}
                        ]
                    },
                    {
                        text: '吉林市',
                        id: '02',
                        city: [
                            {text: '昌邑区', id: '02'},
                            {text: '龙潭区', id: '03'},
                            {text: '船营区', id: '04'},
                            {text: '丰满区', id: '11'},
                            {text: '永吉县', id: '21'},
                            {text: '蛟河市', id: '81'},
                            {text: '桦甸市', id: '82'},
                            {text: '舒兰市', id: '83'},
                            {text: '磐石市', id: '84'}
                        ]
                    },
                    {
                        text: '四平市',
                        id: '03',
                        city: [
                            {text: '铁西区', id: '02'},
                            {text: '铁东区', id: '03'},
                            {text: '梨树县', id: '22'},
                            {text: '伊通满族自治县', id: '23'},
                            {text: '公主岭市', id: '81'},
                            {text: '双辽市', id: '82'}
                        ]
                    },
                    {
                        text: '辽源市',
                        id: '04',
                        city: [
                            {text: '龙山区', id: '02'},
                            {text: '西安区', id: '03'},
                            {text: '东丰县', id: '21'},
                            {text: '东辽县', id: '22'}
                        ]
                    },
                    {
                        text: '通化市',
                        id: '05',
                        city: [
                            {text: '东昌区', id: '02'},
                            {text: '二道江区', id: '03'},
                            {text: '通化县', id: '21'},
                            {text: '辉南县', id: '23'},
                            {text: '柳河县', id: '24'},
                            {text: '梅河口市', id: '81'},
                            {text: '集安市', id: '82'}
                        ]
                    },
                    {
                        text: '白山市',
                        id: '06',
                        city: [
                            {text: '八道江区', id: '02'},
                            {text: '江源区', id: '04'},
                            {text: '抚松县', id: '21'},
                            {text: '靖宇县', id: '22'},
                            {text: '长白朝鲜族自治县', id: '23'},
                            {text: '临江市', id: '81'}
                        ]
                    },
                    {
                        text: '松原市',
                        id: '07',
                        city: [
                            {text: '宁江区', id: '02'},
                            {text: '前郭尔罗斯蒙古族自治县', id: '21'},
                            {text: '长岭县', id: '22'},
                            {text: '乾安县', id: '23'},
                            {text: '扶余县', id: '24'}
                        ]
                    },
                    {
                        text: '白城市',
                        id: '08',
                        city: [
                            {text: '洮北区', id: '02'},
                            {text: '镇赉县', id: '21'},
                            {text: '通榆县', id: '22'},
                            {text: '洮南市', id: '81'},
                            {text: '大安市', id: '82'}
                        ]
                    },
                    {
                        text: '延边朝鲜族自治州',
                        id: '24',
                        city: [
                            {text: '延吉市', id: '01'},
                            {text: '图们市', id: '02'},
                            {text: '敦化市', id: '03'},
                            {text: '珲春市', id: '04'},
                            {text: '龙井市', id: '05'},
                            {text: '和龙市', id: '06'},
                            {text: '汪清县', id: '24'},
                            {text: '安图县', id: '26'}
                        ]
                    }
                ]

            },
            {

                text: '黑龙江省',
                id: '23',
                state: [
                    {
                        text: '哈尔滨市',
                        id: '01',
                        city: [
                            {text: '道里区', id: '02'},
                            {text: '南岗区', id: '03'},
                            {text: '道外区', id: '04'},
                            {text: '平房区', id: '08'},
                            {text: '松北区', id: '09'},
                            {text: '香坊区', id: '10'},
                            {text: '呼兰区', id: '11'},
                            {text: '阿城区', id: '12'},
                            {text: '依兰县', id: '23'},
                            {text: '方正县', id: '24'},
                            {text: '宾县', id: '25'},
                            {text: '巴彦县', id: '26'},
                            {text: '木兰县', id: '27'},
                            {text: '通河县', id: '28'},
                            {text: '延寿县', id: '29'},
                            {text: '双城市', id: '82'},
                            {text: '尚志市', id: '83'},
                            {text: '五常市', id: '84'}
                        ]
                    },
                    {
                        text: '齐齐哈尔市',
                        id: '02',
                        city: [
                            {text: '龙沙区', id: '02'},
                            {text: '建华区', id: '03'},
                            {text: '铁锋区', id: '04'},
                            {text: '昂昂溪区', id: '05'},
                            {text: '富拉尔基区', id: '06'},
                            {text: '碾子山区', id: '07'},
                            {text: '梅里斯达斡尔族区', id: '08'},
                            {text: '龙江县', id: '21'},
                            {text: '依安县', id: '23'},
                            {text: '泰来县', id: '24'},
                            {text: '甘南县', id: '25'},
                            {text: '富裕县', id: '27'},
                            {text: '克山县', id: '29'},
                            {text: '克东县', id: '30'},
                            {text: '拜泉县', id: '31'},
                            {text: '讷河市', id: '81'}
                        ]
                    },
                    {
                        text: '鸡西市',
                        id: '03',
                        city: [
                            {text: '鸡冠区', id: '02'},
                            {text: '恒山区', id: '03'},
                            {text: '滴道区', id: '04'},
                            {text: '梨树区', id: '05'},
                            {text: '城子河区', id: '06'},
                            {text: '麻山区', id: '07'},
                            {text: '鸡东县', id: '21'},
                            {text: '虎林市', id: '81'},
                            {text: '密山市', id: '82'}
                        ]
                    },
                    {
                        text: '鹤岗市',
                        id: '04',
                        city: [
                            {text: '向阳区', id: '02'},
                            {text: '工农区', id: '03'},
                            {text: '南山区', id: '04'},
                            {text: '兴安区', id: '05'},
                            {text: '东山区', id: '06'},
                            {text: '兴山区', id: '07'},
                            {text: '萝北县', id: '21'},
                            {text: '绥滨县', id: '22'}
                        ]
                    },
                    {
                        text: '双鸭山市',
                        id: '05',
                        city: [
                            {text: '尖山区', id: '02'},
                            {text: '岭东区', id: '03'},
                            {text: '四方台区', id: '05'},
                            {text: '宝山区', id: '06'},
                            {text: '集贤县', id: '21'},
                            {text: '友谊县', id: '22'},
                            {text: '宝清县', id: '23'},
                            {text: '饶河县', id: '24'}
                        ]
                    },
                    {
                        text: '大庆市',
                        id: '06',
                        city: [
                            {text: '萨尔图区', id: '02'},
                            {text: '龙凤区', id: '03'},
                            {text: '让胡路区', id: '04'},
                            {text: '红岗区', id: '05'},
                            {text: '大同区', id: '06'},
                            {text: '肇州县', id: '21'},
                            {text: '肇源县', id: '22'},
                            {text: '林甸县', id: '23'},
                            {text: '杜尔伯特蒙古族自治县', id: '24'}
                        ]
                    },
                    {
                        text: '伊春市',
                        id: '07',
                        city: [
                            {text: '伊春区', id: '02'},
                            {text: '南岔区', id: '03'},
                            {text: '友好区', id: '04'},
                            {text: '西林区', id: '05'},
                            {text: '翠峦区', id: '06'},
                            {text: '新青区', id: '07'},
                            {text: '美溪区', id: '08'},
                            {text: '金山屯区', id: '09'},
                            {text: '五营区', id: '10'},
                            {text: '乌马河区', id: '11'},
                            {text: '汤旺河区', id: '12'},
                            {text: '带岭区', id: '13'},
                            {text: '乌伊岭区', id: '14'},
                            {text: '红星区', id: '15'},
                            {text: '上甘岭区', id: '16'},
                            {text: '嘉荫县', id: '22'},
                            {text: '铁力市', id: '81'}
                        ]
                    },
                    {
                        text: '佳木斯市',
                        id: '08',
                        city: [
                            {text: '向阳区', id: '03'},
                            {text: '前进区', id: '04'},
                            {text: '东风区', id: '05'},
                            {text: '郊区', id: '11'},
                            {text: '桦南县', id: '22'},
                            {text: '桦川县', id: '26'},
                            {text: '汤原县', id: '28'},
                            {text: '抚远县', id: '33'},
                            {text: '同江市', id: '81'},
                            {text: '富锦市', id: '82'}
                        ]
                    },
                    {
                        text: '七台河市',
                        id: '09',
                        city: [
                            {text: '新兴区', id: '02'},
                            {text: '桃山区', id: '03'},
                            {text: '茄子河区', id: '04'},
                            {text: '勃利县', id: '21'}
                        ]
                    },
                    {
                        text: '牡丹江市',
                        id: '10',
                        city: [
                            {text: '东安区', id: '02'},
                            {text: '阳明区', id: '03'},
                            {text: '爱民区', id: '04'},
                            {text: '西安区', id: '05'},
                            {text: '东宁县', id: '24'},
                            {text: '林口县', id: '25'},
                            {text: '绥芬河市', id: '81'},
                            {text: '海林市', id: '83'},
                            {text: '宁安市', id: '84'},
                            {text: '穆棱市', id: '85'}
                        ]
                    },
                    {
                        text: '黑河市',
                        id: '11',
                        city: [
                            {text: '爱辉区', id: '02'},
                            {text: '嫩江县', id: '21'},
                            {text: '逊克县', id: '23'},
                            {text: '孙吴县', id: '24'},
                            {text: '北安市', id: '81'},
                            {text: '五大连池市', id: '82'}
                        ]
                    },
                    {
                        text: '绥化市',
                        id: '12',
                        city: [
                            {text: '北林区', id: '02'},
                            {text: '望奎县', id: '21'},
                            {text: '兰西县', id: '22'},
                            {text: '青冈县', id: '23'},
                            {text: '庆安县', id: '24'},
                            {text: '明水县', id: '25'},
                            {text: '绥棱县', id: '26'},
                            {text: '安达市', id: '81'},
                            {text: '肇东市', id: '82'},
                            {text: '海伦市', id: '83'}
                        ]
                    },
                    {
                        text: '大兴安岭地区',
                        id: '27',
                        city: [
                            {text: '加格达奇区', id: '01'},
                            {text: '松岭区', id: '02'},
                            {text: '新林区', id: '03'},
                            {text: '呼中区', id: '04'},
                            {text: '呼玛县', id: '21'},
                            {text: '塔河县', id: '22'},
                            {text: '漠河县', id: '23'}
                        ]
                    }
                ]

            },
            {

                text: '上海',
                id: '31',
                state: [
                    {
                        text: '上海市',
                        id: '01',
                        city: [
                            {text: '黄浦区', id: '01'},
                            {text: '卢湾区', id: '03'},
                            {text: '徐汇区', id: '04'},
                            {text: '长宁区', id: '05'},
                            {text: '静安区', id: '06'},
                            {text: '普陀区', id: '07'},
                            {text: '闸北区', id: '08'},
                            {text: '虹口区', id: '09'},
                            {text: '杨浦区', id: '10'},
                            {text: '闵行区', id: '12'},
                            {text: '宝山区', id: '13'},
                            {text: '嘉定区', id: '14'},
                            {text: '浦东新区', id: '15'},
                            {text: '金山区', id: '16'},
                            {text: '松江区', id: '17'},
                            {text: '青浦区', id: '18'},
                            {text: '南汇区', id: '19'},
                            {text: '奉贤区', id: '20'},
                            {text: '崇明县', id: '30'}
                        ]
                    }
                ]

            },
            {

                text: '江苏省',
                id: '32',
                state: [
                    {
                        text: '南京市',
                        id: '01',
                        city: [
                            {text: '玄武区', id: '02'},
                            {text: '白下区', id: '03'},
                            {text: '秦淮区', id: '04'},
                            {text: '建邺区', id: '05'},
                            {text: '鼓楼区', id: '06'},
                            {text: '下关区', id: '07'},
                            {text: '浦口区', id: '11'},
                            {text: '栖霞区', id: '13'},
                            {text: '雨花台区', id: '14'},
                            {text: '江宁区', id: '15'},
                            {text: '六合区', id: '16'},
                            {text: '溧水县', id: '24'},
                            {text: '高淳县', id: '25'}
                        ]
                    },
                    {
                        text: '无锡市',
                        id: '02',
                        city: [
                            {text: '崇安区', id: '02'},
                            {text: '南长区', id: '03'},
                            {text: '北塘区', id: '04'},
                            {text: '锡山区', id: '05'},
                            {text: '惠山区', id: '06'},
                            {text: '滨湖区', id: '11'},
                            {text: '江阴市', id: '81'},
                            {text: '宜兴市', id: '82'}
                        ]
                    },
                    {
                        text: '徐州市',
                        id: '03',
                        city: [
                            {text: '鼓楼区', id: '02'},
                            {text: '云龙区', id: '03'},
                            {text: '九里区', id: '04'},
                            {text: '贾汪区', id: '05'},
                            {text: '泉山区', id: '11'},
                            {text: '丰县', id: '21'},
                            {text: '沛县', id: '22'},
                            {text: '铜山县', id: '23'},
                            {text: '睢宁县', id: '24'},
                            {text: '新沂市', id: '81'},
                            {text: '邳州市', id: '82'}
                        ]
                    },
                    {
                        text: '常州市',
                        id: '04',
                        city: [
                            {text: '天宁区', id: '02'},
                            {text: '钟楼区', id: '04'},
                            {text: '戚墅堰区', id: '05'},
                            {text: '新北区', id: '11'},
                            {text: '武进区', id: '12'},
                            {text: '溧阳市', id: '81'},
                            {text: '金坛市', id: '82'}
                        ]
                    },
                    {
                        text: '苏州市',
                        id: '05',
                        city: [
                            {text: '沧浪区', id: '02'},
                            {text: '平江区', id: '03'},
                            {text: '金阊区', id: '04'},
                            {text: '虎丘区', id: '05'},
                            {text: '吴中区', id: '06'},
                            {text: '相城区', id: '07'},
                            {text: '常熟市', id: '81'},
                            {text: '张家港市', id: '82'},
                            {text: '昆山市', id: '83'},
                            {text: '吴江市', id: '84'},
                            {text: '太仓市', id: '85'}
                        ]
                    },
                    {
                        text: '南通市',
                        id: '06',
                        city: [
                            {text: '崇川区', id: '02'},
                            {text: '港闸区', id: '11'},
                            {text: '海安县', id: '21'},
                            {text: '如东县', id: '23'},
                            {text: '启东市', id: '81'},
                            {text: '如皋市', id: '82'},
                            {text: '通州市', id: '83'},
                            {text: '海门市', id: '84'}
                        ]
                    },
                    {
                        text: '连云港市',
                        id: '07',
                        city: [
                            {text: '连云区', id: '03'},
                            {text: '新浦区', id: '05'},
                            {text: '海州区', id: '06'},
                            {text: '赣榆县', id: '21'},
                            {text: '东海县', id: '22'},
                            {text: '灌云县', id: '23'},
                            {text: '灌南县', id: '24'}
                        ]
                    },
                    {
                        text: '淮安市',
                        id: '08',
                        city: [
                            {text: '清河区', id: '02'},
                            {text: '楚州区', id: '03'},
                            {text: '淮阴区', id: '04'},
                            {text: '清浦区', id: '11'},
                            {text: '涟水县', id: '26'},
                            {text: '洪泽县', id: '29'},
                            {text: '盱眙县', id: '30'},
                            {text: '金湖县', id: '31'}
                        ]
                    },
                    {
                        text: '盐城市',
                        id: '09',
                        city: [
                            {text: '亭湖区', id: '02'},
                            {text: '盐都区', id: '03'},
                            {text: '响水县', id: '21'},
                            {text: '滨海县', id: '22'},
                            {text: '阜宁县', id: '23'},
                            {text: '射阳县', id: '24'},
                            {text: '建湖县', id: '25'},
                            {text: '东台市', id: '81'},
                            {text: '大丰市', id: '82'}
                        ]
                    },
                    {
                        text: '扬州市',
                        id: '10',
                        city: [
                            {text: '广陵区', id: '02'},
                            {text: '邗江区', id: '03'},
                            {text: '维扬区', id: '11'},
                            {text: '宝应县', id: '23'},
                            {text: '仪征市', id: '81'},
                            {text: '高邮市', id: '84'},
                            {text: '江都市', id: '88'}
                        ]
                    },
                    {
                        text: '镇江市',
                        id: '11',
                        city: [
                            {text: '京口区', id: '02'},
                            {text: '润州区', id: '11'},
                            {text: '丹徒区', id: '12'},
                            {text: '丹阳市', id: '81'},
                            {text: '扬中市', id: '82'},
                            {text: '句容市', id: '83'}
                        ]
                    },
                    {
                        text: '泰州市',
                        id: '12',
                        city: [
                            {text: '海陵区', id: '02'},
                            {text: '高港区', id: '03'},
                            {text: '兴化市', id: '81'},
                            {text: '靖江市', id: '82'},
                            {text: '泰兴市', id: '83'},
                            {text: '姜堰市', id: '84'}
                        ]
                    },
                    {
                        text: '宿迁市',
                        id: '13',
                        city: [
                            {text: '宿城区', id: '02'},
                            {text: '宿豫区', id: '11'},
                            {text: '沭阳县', id: '22'},
                            {text: '泗阳县', id: '23'},
                            {text: '泗洪县', id: '24'}
                        ]
                    }
                ]

            },
            {

                text: '浙江省',
                id: '33',
                state: [
                    {
                        text: '杭州市',
                        id: '01',
                        city: [
                            {text: '上城区', id: '02'},
                            {text: '下城区', id: '03'},
                            {text: '江干区', id: '04'},
                            {text: '拱墅区', id: '05'},
                            {text: '西湖区', id: '06'},
                            {text: '滨江区', id: '08'},
                            {text: '萧山区', id: '09'},
                            {text: '余杭区', id: '10'},
                            {text: '桐庐县', id: '22'},
                            {text: '淳安县', id: '27'},
                            {text: '建德市', id: '82'},
                            {text: '富阳市', id: '83'},
                            {text: '临安市', id: '85'}
                        ]
                    },
                    {
                        text: '宁波市',
                        id: '02',
                        city: [
                            {text: '海曙区', id: '03'},
                            {text: '江东区', id: '04'},
                            {text: '江北区', id: '05'},
                            {text: '北仑区', id: '06'},
                            {text: '镇海区', id: '11'},
                            {text: '鄞州区', id: '12'},
                            {text: '象山县', id: '25'},
                            {text: '宁海县', id: '26'},
                            {text: '余姚市', id: '81'},
                            {text: '慈溪市', id: '82'},
                            {text: '奉化市', id: '83'}
                        ]
                    },
                    {
                        text: '温州市',
                        id: '03',
                        city: [
                            {text: '鹿城区', id: '02'},
                            {text: '龙湾区', id: '03'},
                            {text: '瓯海区', id: '04'},
                            {text: '洞头县', id: '22'},
                            {text: '永嘉县', id: '24'},
                            {text: '平阳县', id: '26'},
                            {text: '苍南县', id: '27'},
                            {text: '文成县', id: '28'},
                            {text: '泰顺县', id: '29'},
                            {text: '瑞安市', id: '81'},
                            {text: '乐清市', id: '82'}
                        ]
                    },
                    {
                        text: '嘉兴市',
                        id: '04',
                        city: [
                            {text: '秀城区', id: '02'},
                            {text: '秀洲区', id: '11'},
                            {text: '嘉善县', id: '21'},
                            {text: '海盐县', id: '24'},
                            {text: '海宁市', id: '81'},
                            {text: '平湖市', id: '82'},
                            {text: '桐乡市', id: '83'}
                        ]
                    },
                    {
                        text: '湖州市',
                        id: '05',
                        city: [
                            {text: '吴兴区', id: '02'},
                            {text: '南浔区', id: '03'},
                            {text: '德清县', id: '21'},
                            {text: '长兴县', id: '22'},
                            {text: '安吉县', id: '23'}
                        ]
                    },
                    {
                        text: '绍兴市',
                        id: '06',
                        city: [
                            {text: '越城区', id: '02'},
                            {text: '绍兴县', id: '21'},
                            {text: '新昌县', id: '24'},
                            {text: '诸暨市', id: '81'},
                            {text: '上虞市', id: '82'},
                            {text: '嵊州市', id: '83'}
                        ]
                    },
                    {
                        text: '金华市',
                        id: '07',
                        city: [
                            {text: '婺城区', id: '02'},
                            {text: '金东区', id: '03'},
                            {text: '武义县', id: '23'},
                            {text: '浦江县', id: '26'},
                            {text: '磐安县', id: '27'},
                            {text: '兰溪市', id: '81'},
                            {text: '义乌市', id: '82'},
                            {text: '东阳市', id: '83'},
                            {text: '永康市', id: '84'}
                        ]
                    },
                    {
                        text: '衢州市',
                        id: '08',
                        city: [
                            {text: '柯城区', id: '02'},
                            {text: '衢江区', id: '03'},
                            {text: '常山县', id: '22'},
                            {text: '开化县', id: '24'},
                            {text: '龙游县', id: '25'},
                            {text: '江山市', id: '81'}
                        ]
                    },
                    {
                        text: '舟山市',
                        id: '09',
                        city: [
                            {text: '定海区', id: '02'},
                            {text: '普陀区', id: '03'},
                            {text: '岱山县', id: '21'},
                            {text: '嵊泗县', id: '22'}
                        ]
                    },
                    {
                        text: '台州市',
                        id: '10',
                        city: [
                            {text: '椒江区', id: '02'},
                            {text: '黄岩区', id: '03'},
                            {text: '路桥区', id: '04'},
                            {text: '玉环县', id: '21'},
                            {text: '三门县', id: '22'},
                            {text: '天台县', id: '23'},
                            {text: '仙居县', id: '24'},
                            {text: '温岭市', id: '81'},
                            {text: '临海市', id: '82'}
                        ]
                    },
                    {
                        text: '丽水市',
                        id: '11',
                        city: [
                            {text: '莲都区', id: '02'},
                            {text: '青田县', id: '21'},
                            {text: '缙云县', id: '22'},
                            {text: '遂昌县', id: '23'},
                            {text: '松阳县', id: '24'},
                            {text: '云和县', id: '25'},
                            {text: '庆元县', id: '26'},
                            {text: '景宁畲族自治县', id: '27'},
                            {text: '龙泉市', id: '81'}
                        ]
                    }
                ]

            },
            {

                text: '安徽省',
                id: '34',
                state: [
                    {
                        text: '合肥市',
                        id: '01',
                        city: [
                            {text: '瑶海区', id: '02'},
                            {text: '庐阳区', id: '03'},
                            {text: '蜀山区', id: '04'},
                            {text: '包河区', id: '11'},
                            {text: '长丰县', id: '21'},
                            {text: '肥东县', id: '22'},
                            {text: '肥西县', id: '23'}
                        ]
                    },
                    {
                        text: '芜湖市',
                        id: '02',
                        city: [
                            {text: '镜湖区', id: '02'},
                            {text: '弋江区', id: '03'},
                            {text: '鸠江区', id: '07'},
                            {text: '三山区', id: '08'},
                            {text: '芜湖县', id: '21'},
                            {text: '繁昌县', id: '22'},
                            {text: '南陵县', id: '23'}
                        ]
                    },
                    {
                        text: '蚌埠市',
                        id: '03',
                        city: [
                            {text: '龙子湖区', id: '02'},
                            {text: '蚌山区', id: '03'},
                            {text: '禹会区', id: '04'},
                            {text: '淮上区', id: '11'},
                            {text: '怀远县', id: '21'},
                            {text: '五河县', id: '22'},
                            {text: '固镇县', id: '23'}
                        ]
                    },
                    {
                        text: '淮南市',
                        id: '04',
                        city: [
                            {text: '大通区', id: '02'},
                            {text: '田家庵区', id: '03'},
                            {text: '谢家集区', id: '04'},
                            {text: '八公山区', id: '05'},
                            {text: '潘集区', id: '06'},
                            {text: '凤台县', id: '21'}
                        ]
                    },
                    {
                        text: '马鞍山市',
                        id: '05',
                        city: [
                            {text: '金家庄区', id: '02'},
                            {text: '花山区', id: '03'},
                            {text: '雨山区', id: '04'},
                            {text: '当涂县', id: '21'}
                        ]
                    },
                    {
                        text: '淮北市',
                        id: '06',
                        city: [
                            {text: '杜集区', id: '02'},
                            {text: '相山区', id: '03'},
                            {text: '烈山区', id: '04'},
                            {text: '濉溪县', id: '21'}
                        ]
                    },
                    {
                        text: '铜陵市',
                        id: '07',
                        city: [
                            {text: '铜官山区', id: '02'},
                            {text: '狮子山区', id: '03'},
                            {text: '郊区', id: '11'},
                            {text: '铜陵县', id: '21'}
                        ]
                    },
                    {
                        text: '安庆市',
                        id: '08',
                        city: [
                            {text: '迎江区', id: '02'},
                            {text: '大观区', id: '03'},
                            {text: '宜秀区', id: '11'},
                            {text: '怀宁县', id: '22'},
                            {text: '枞阳县', id: '23'},
                            {text: '潜山县', id: '24'},
                            {text: '太湖县', id: '25'},
                            {text: '宿松县', id: '26'},
                            {text: '望江县', id: '27'},
                            {text: '岳西县', id: '28'},
                            {text: '桐城市', id: '81'}
                        ]
                    },
                    {
                        text: '黄山市',
                        id: '10',
                        city: [
                            {text: '屯溪区', id: '02'},
                            {text: '黄山区', id: '03'},
                            {text: '徽州区', id: '04'},
                            {text: '歙县', id: '21'},
                            {text: '休宁县', id: '22'},
                            {text: '黟县', id: '23'},
                            {text: '祁门县', id: '24'}
                        ]
                    },
                    {
                        text: '滁州市',
                        id: '11',
                        city: [
                            {text: '琅琊区', id: '02'},
                            {text: '南谯区', id: '03'},
                            {text: '来安县', id: '22'},
                            {text: '全椒县', id: '24'},
                            {text: '定远县', id: '25'},
                            {text: '凤阳县', id: '26'},
                            {text: '天长市', id: '81'},
                            {text: '明光市', id: '82'}
                        ]
                    },
                    {
                        text: '阜阳市',
                        id: '12',
                        city: [
                            {text: '颍州区', id: '02'},
                            {text: '颍东区', id: '03'},
                            {text: '颍泉区', id: '04'},
                            {text: '临泉县', id: '21'},
                            {text: '太和县', id: '22'},
                            {text: '阜南县', id: '25'},
                            {text: '颍上县', id: '26'},
                            {text: '颍上县', id: '82'}
                        ]
                    },
                    {
                        text: '宿州市',
                        id: '13',
                        city: [
                            {text: '埇桥区', id: '02'},
                            {text: '砀山县', id: '21'},
                            {text: '萧县', id: '22'},
                            {text: '灵璧县', id: '23'},
                            {text: '泗县', id: '24'}
                        ]
                    },
                    {
                        text: '巢湖市',
                        id: '14',
                        city: [
                            {text: '居巢区', id: '02'},
                            {text: '庐江县', id: '21'},
                            {text: '无为县', id: '22'},
                            {text: '含山县', id: '23'},
                            {text: '和县', id: '24'}
                        ]
                    },
                    {
                        text: '六安市',
                        id: '15',
                        city: [
                            {text: '金安区', id: '02'},
                            {text: '裕安区', id: '03'},
                            {text: '寿县', id: '21'},
                            {text: '霍邱县', id: '22'},
                            {text: '舒城县', id: '23'},
                            {text: '金寨县', id: '24'},
                            {text: '霍山县', id: '25'}
                        ]
                    },
                    {
                        text: '亳州市',
                        id: '16',
                        city: [
                            {text: '谯城区', id: '02'},
                            {text: '涡阳县', id: '21'},
                            {text: '蒙城县', id: '22'},
                            {text: '利辛县', id: '23'}
                        ]
                    },
                    {
                        text: '池州市',
                        id: '17',
                        city: [
                            {text: '贵池区', id: '02'},
                            {text: '东至县', id: '21'},
                            {text: '石台县', id: '22'},
                            {text: '青阳县', id: '23'}
                        ]
                    },
                    {
                        text: '宣城市',
                        id: '18',
                        city: [
                            {text: '宣州区', id: '02'},
                            {text: '郎溪县', id: '21'},
                            {text: '广德县', id: '22'},
                            {text: '泾县', id: '23'},
                            {text: '绩溪县', id: '24'},
                            {text: '旌德县', id: '25'},
                            {text: '宁国市', id: '81'}
                        ]
                    }
                ]

            },
            {

                text: '福建省',
                id: '35',
                state: [
                    {
                        text: '福州市',
                        id: '01',
                        city: [
                            {text: '鼓楼区', id: '02'},
                            {text: '台江区', id: '03'},
                            {text: '仓山区', id: '04'},
                            {text: '马尾区', id: '05'},
                            {text: '晋安区', id: '11'},
                            {text: '闽侯县', id: '21'},
                            {text: '连江县', id: '22'},
                            {text: '罗源县', id: '23'},
                            {text: '闽清县', id: '24'},
                            {text: '永泰县', id: '25'},
                            {text: '平潭县', id: '28'},
                            {text: '福清市', id: '81'},
                            {text: '长乐市', id: '82'}
                        ]
                    },
                    {
                        text: '厦门市',
                        id: '02',
                        city: [
                            {text: '思明区', id: '03'},
                            {text: '海沧区', id: '05'},
                            {text: '湖里区', id: '06'},
                            {text: '集美区', id: '11'},
                            {text: '同安区', id: '12'},
                            {text: '翔安区', id: '13'}
                        ]
                    },
                    {
                        text: '莆田市',
                        id: '03',
                        city: [
                            {text: '城厢区', id: '02'},
                            {text: '涵江区', id: '03'},
                            {text: '荔城区', id: '04'},
                            {text: '秀屿区', id: '05'},
                            {text: '仙游县', id: '22'}
                        ]
                    },
                    {
                        text: '三明市',
                        id: '04',
                        city: [
                            {text: '梅列区', id: '02'},
                            {text: '三元区', id: '03'},
                            {text: '明溪县', id: '21'},
                            {text: '清流县', id: '23'},
                            {text: '宁化县', id: '24'},
                            {text: '大田县', id: '25'},
                            {text: '尤溪县', id: '26'},
                            {text: '沙县', id: '27'},
                            {text: '将乐县', id: '28'},
                            {text: '泰宁县', id: '29'},
                            {text: '建宁县', id: '30'},
                            {text: '永安市', id: '81'}
                        ]
                    },
                    {
                        text: '泉州市',
                        id: '05',
                        city: [
                            {text: '鲤城区', id: '02'},
                            {text: '丰泽区', id: '03'},
                            {text: '洛江区', id: '04'},
                            {text: '泉港区', id: '05'},
                            {text: '惠安县', id: '21'},
                            {text: '安溪县', id: '24'},
                            {text: '永春县', id: '25'},
                            {text: '德化县', id: '26'},
                            {text: '金门县', id: '27'},
                            {text: '石狮市', id: '81'},
                            {text: '晋江市', id: '82'},
                            {text: '南安市', id: '83'}
                        ]
                    },
                    {
                        text: '漳州市',
                        id: '06',
                        city: [
                            {text: '芗城区', id: '02'},
                            {text: '龙文区', id: '03'},
                            {text: '云霄县', id: '22'},
                            {text: '漳浦县', id: '23'},
                            {text: '诏安县', id: '24'},
                            {text: '长泰县', id: '25'},
                            {text: '东山县', id: '26'},
                            {text: '南靖县', id: '27'},
                            {text: '平和县', id: '28'},
                            {text: '华安县', id: '29'},
                            {text: '龙海市', id: '81'}
                        ]
                    },
                    {
                        text: '南平市',
                        id: '07',
                        city: [
                            {text: '延平区', id: '02'},
                            {text: '顺昌县', id: '21'},
                            {text: '浦城县', id: '22'},
                            {text: '光泽县', id: '23'},
                            {text: '松溪县', id: '24'},
                            {text: '政和县', id: '25'},
                            {text: '邵武市', id: '81'},
                            {text: '武夷山市', id: '82'},
                            {text: '建瓯市', id: '83'},
                            {text: '建阳市', id: '84'}
                        ]
                    },
                    {
                        text: '龙岩市',
                        id: '08',
                        city: [
                            {text: '新罗区', id: '02'},
                            {text: '长汀县', id: '21'},
                            {text: '永定县', id: '22'},
                            {text: '上杭县', id: '23'},
                            {text: '武平县', id: '24'},
                            {text: '连城县', id: '25'},
                            {text: '漳平市', id: '81'}
                        ]
                    },
                    {
                        text: '宁德市',
                        id: '09',
                        city: [
                            {text: '蕉城区', id: '02'},
                            {text: '霞浦县', id: '21'},
                            {text: '古田县', id: '22'},
                            {text: '屏南县', id: '23'},
                            {text: '寿宁县', id: '24'},
                            {text: '周宁县', id: '25'},
                            {text: '柘荣县', id: '26'},
                            {text: '福安市', id: '81'},
                            {text: '福鼎市', id: '82'}
                        ]
                    }
                ]

            },
            {

                text: '江西省',
                id: '36',
                state: [
                    {
                        text: '南昌市',
                        id: '01',
                        city: [
                            {text: '东湖区', id: '02'},
                            {text: '西湖区', id: '03'},
                            {text: '青云谱区', id: '04'},
                            {text: '湾里区', id: '05'},
                            {text: '青山湖区', id: '11'},
                            {text: '南昌县', id: '21'},
                            {text: '新建县', id: '22'},
                            {text: '安义县', id: '23'},
                            {text: '进贤县', id: '24'}
                        ]
                    },
                    {
                        text: '景德镇市',
                        id: '02',
                        city: [
                            {text: '昌江区', id: '02'},
                            {text: '珠山区', id: '03'},
                            {text: '浮梁县', id: '22'},
                            {text: '乐平市', id: '81'}
                        ]
                    },
                    {
                        text: '萍乡市',
                        id: '03',
                        city: [
                            {text: '安源区', id: '02'},
                            {text: '湘东区', id: '13'},
                            {text: '莲花县', id: '21'},
                            {text: '上栗县', id: '22'},
                            {text: '芦溪县', id: '23'}
                        ]
                    },
                    {
                        text: '九江市',
                        id: '04',
                        city: [
                            {text: '庐山区', id: '02'},
                            {text: '浔阳区', id: '03'},
                            {text: '九江县', id: '21'},
                            {text: '武宁县', id: '23'},
                            {text: '修水县', id: '24'},
                            {text: '永修县', id: '25'},
                            {text: '德安县', id: '26'},
                            {text: '星子县', id: '27'},
                            {text: '都昌县', id: '28'},
                            {text: '湖口县', id: '29'},
                            {text: '彭泽县', id: '30'},
                            {text: '瑞昌市', id: '81'}
                        ]
                    },
                    {
                        text: '新余市',
                        id: '05',
                        city: [
                            {text: '渝水区', id: '02'},
                            {text: '分宜县', id: '21'}
                        ]
                    },
                    {
                        text: '鹰潭市',
                        id: '06',
                        city: [
                            {text: '月湖区', id: '02'},
                            {text: '余江县', id: '22'},
                            {text: '贵溪市', id: '81'}
                        ]
                    },
                    {
                        text: '赣州市',
                        id: '07',
                        city: [
                            {text: '章贡区', id: '02'},
                            {text: '赣县', id: '21'},
                            {text: '信丰县', id: '22'},
                            {text: '大余县', id: '23'},
                            {text: '上犹县', id: '24'},
                            {text: '崇义县', id: '25'},
                            {text: '安远县', id: '26'},
                            {text: '龙南县', id: '27'},
                            {text: '定南县', id: '28'},
                            {text: '全南县', id: '29'},
                            {text: '宁都县', id: '30'},
                            {text: '于都县', id: '31'},
                            {text: '兴国县', id: '32'},
                            {text: '会昌县', id: '33'},
                            {text: '寻乌县', id: '34'},
                            {text: '石城县', id: '35'},
                            {text: '瑞金市', id: '81'},
                            {text: '南康市', id: '82'}
                        ]
                    },
                    {
                        text: '吉安市',
                        id: '08',
                        city: [
                            {text: '吉州区', id: '02'},
                            {text: '青原区', id: '03'},
                            {text: '吉安县', id: '21'},
                            {text: '吉水县', id: '22'},
                            {text: '峡江县', id: '23'},
                            {text: '新干县', id: '24'},
                            {text: '永丰县', id: '25'},
                            {text: '泰和县', id: '26'},
                            {text: '遂川县', id: '27'},
                            {text: '万安县', id: '28'},
                            {text: '安福县', id: '29'},
                            {text: '永新县', id: '30'},
                            {text: '井冈山市', id: '81'}
                        ]
                    },
                    {
                        text: '宜春市',
                        id: '09',
                        city: [
                            {text: '袁州区', id: '02'},
                            {text: '奉新县', id: '21'},
                            {text: '万载县', id: '22'},
                            {text: '上高县', id: '23'},
                            {text: '宜丰县', id: '24'},
                            {text: '靖安县', id: '25'},
                            {text: '铜鼓县', id: '26'},
                            {text: '丰城市', id: '81'},
                            {text: '樟树市', id: '82'},
                            {text: '高安市', id: '83'}
                        ]
                    },
                    {
                        text: '抚州市',
                        id: '10',
                        city: [
                            {text: '临川区', id: '02'},
                            {text: '南城县', id: '21'},
                            {text: '黎川县', id: '22'},
                            {text: '南丰县', id: '23'},
                            {text: '崇仁县', id: '24'},
                            {text: '乐安县', id: '25'},
                            {text: '宜黄县', id: '26'},
                            {text: '金溪县', id: '27'},
                            {text: '资溪县', id: '28'},
                            {text: '东乡县', id: '29'},
                            {text: '广昌县', id: '30'}
                        ]
                    },
                    {
                        text: '上饶市',
                        id: '11',
                        city: [
                            {text: '信州区', id: '02'},
                            {text: '上饶县', id: '21'},
                            {text: '广丰县', id: '22'},
                            {text: '玉山县', id: '23'},
                            {text: '铅山县', id: '24'},
                            {text: '横峰县', id: '25'},
                            {text: '弋阳县', id: '26'},
                            {text: '余干县', id: '27'},
                            {text: '鄱阳县', id: '28'},
                            {text: '万年县', id: '29'},
                            {text: '婺源县', id: '30'},
                            {text: '德兴市', id: '31'}
                        ]
                    }
                ]

            },
            {

                text: '山东省',
                id: '37',
                state: [
                    {
                        text: '济南市',
                        id: '01',
                        city: [
                            {text: '历下区', id: '02'},
                            {text: '市中区', id: '03'},
                            {text: '槐荫区', id: '04'},
                            {text: '天桥区', id: '05'},
                            {text: '历城区', id: '12'},
                            {text: '长清区', id: '13'},
                            {text: '平阴县', id: '24'},
                            {text: '济阳县', id: '25'},
                            {text: '商河县', id: '26'},
                            {text: '章丘市', id: '81'}
                        ]
                    },
                    {
                        text: '青岛市',
                        id: '02',
                        city: [
                            {text: '市南区', id: '02'},
                            {text: '市北区', id: '03'},
                            {text: '四方区', id: '05'},
                            {text: '黄岛区', id: '11'},
                            {text: '崂山区', id: '12'},
                            {text: '李沧区', id: '13'},
                            {text: '城阳区', id: '14'},
                            {text: '胶州市', id: '81'},
                            {text: '即墨市', id: '82'},
                            {text: '平度市', id: '83'},
                            {text: '胶南市', id: '84'},
                            {text: '莱西市', id: '85'}
                        ]
                    },
                    {
                        text: '淄博市',
                        id: '03',
                        city: [
                            {text: '淄川区', id: '02'},
                            {text: '张店区', id: '03'},
                            {text: '博山区', id: '04'},
                            {text: '临淄区', id: '05'},
                            {text: '周村区', id: '06'},
                            {text: '桓台县', id: '21'},
                            {text: '高青县', id: '22'},
                            {text: '沂源县', id: '23'}
                        ]
                    },
                    {
                        text: '枣庄市',
                        id: '04',
                        city: [
                            {text: '市中区', id: '02'},
                            {text: '薛城区', id: '03'},
                            {text: '峄城区', id: '04'},
                            {text: '台儿庄区', id: '05'},
                            {text: '山亭区', id: '06'},
                            {text: '滕州市', id: '81'}
                        ]
                    },
                    {
                        text: '东营市',
                        id: '05',
                        city: [
                            {text: '东营区', id: '02'},
                            {text: '河口区', id: '03'},
                            {text: '垦利县', id: '21'},
                            {text: '利津县', id: '22'},
                            {text: '广饶县', id: '23'}
                        ]
                    },
                    {
                        text: '烟台市',
                        id: '06',
                        city: [
                            {text: '芝罘区', id: '02'},
                            {text: '福山区', id: '11'},
                            {text: '牟平区', id: '12'},
                            {text: '莱山区', id: '13'},
                            {text: '长岛县', id: '34'},
                            {text: '龙口市', id: '81'},
                            {text: '莱阳市', id: '82'},
                            {text: '莱州市', id: '83'},
                            {text: '蓬莱市', id: '84'},
                            {text: '招远市', id: '85'},
                            {text: '栖霞市', id: '86'},
                            {text: '海阳市', id: '87'}

                        ]
                    },
                    {
                        text: '潍坊市',
                        id: '07',
                        city: [
                            {text: '潍城区', id: '02'},
                            {text: '寒亭区', id: '03'},
                            {text: '坊子区', id: '04'},
                            {text: '奎文区', id: '05'},
                            {text: '临朐县', id: '24'},
                            {text: '昌乐县', id: '25'},
                            {text: '青州市', id: '81'},
                            {text: '诸城市', id: '82'},
                            {text: '寿光市', id: '83'},
                            {text: '安丘市', id: '84'},
                            {text: '高密市', id: '85'},
                            {text: '昌邑市', id: '86'}
                        ]
                    },
                    {
                        text: '济宁市',
                        id: '08',
                        city: [
                            {text: '市中区', id: '02'},
                            {text: '任城区', id: '11'},
                            {text: '微山县', id: '26'},
                            {text: '鱼台县', id: '27'},
                            {text: '金乡县', id: '28'},
                            {text: '嘉祥县', id: '29'},
                            {text: '汶上县', id: '30'},
                            {text: '泗水县', id: '31'},
                            {text: '梁山县', id: '32'},
                            {text: '曲阜市', id: '81'},
                            {text: '兖州市', id: '82'},
                            {text: '邹城市', id: '83'}
                        ]
                    },
                    {
                        text: '泰安市',
                        id: '09',
                        city: [
                            {text: '泰山区', id: '02'},
                            {text: '岱岳区', id: '03'},
                            {text: '宁阳县', id: '21'},
                            {text: '东平县', id: '23'},
                            {text: '新泰市', id: '82'},
                            {text: '肥城市', id: '83'}
                        ]
                    },
                    {
                        text: '威海市',
                        id: '10',
                        city: [
                            {text: '环翠区', id: '02'},
                            {text: '文登市', id: '81'},
                            {text: '荣成市', id: '82'},
                            {text: '乳山市', id: '83'}
                        ]
                    },
                    {
                        text: '日照市',
                        id: '11',
                        city: [
                            {text: '东港区', id: '02'},
                            {text: '岚山区', id: '03'},
                            {text: '五莲县', id: '21'},
                            {text: '莒县', id: '22'}
                        ]
                    },
                    {
                        text: '莱芜市',
                        id: '12',
                        city: [
                            {text: '莱城区', id: '02'},
                            {text: '钢城区', id: '03'}
                        ]
                    },
                    {
                        text: '临沂市',
                        id: '13',
                        city: [
                            {text: '兰山区', id: '02'},
                            {text: '罗庄区', id: '11'},
                            {text: '河东区', id: '12'},
                            {text: '沂南县', id: '21'},
                            {text: '郯城县', id: '22'},
                            {text: '沂水县', id: '23'},
                            {text: '苍山县', id: '24'},
                            {text: '费县', id: '25'},
                            {text: '平邑县', id: '26'},
                            {text: '莒南县', id: '27'},
                            {text: '蒙阴县', id: '28'},
                            {text: '临沭县', id: '29'}
                        ]
                    },
                    {
                        text: '德州市',
                        id: '14',
                        city: [
                            {text: '德城区', id: '02'},
                            {text: '陵县', id: '21'},
                            {text: '宁津县', id: '22'},
                            {text: '庆云县', id: '23'},
                            {text: '临邑县', id: '24'},
                            {text: '齐河县', id: '25'},
                            {text: '平原县', id: '26'},
                            {text: '夏津县', id: '27'},
                            {text: '武城县', id: '28'},
                            {text: '乐陵市', id: '81'},
                            {text: '禹城市', id: '82'}
                        ]
                    },
                    {
                        text: '聊城市',
                        id: '15',
                        city: [
                            {text: '东昌府区', id: '02'},
                            {text: '阳谷县', id: '21'},
                            {text: '莘县', id: '22'},
                            {text: '茌平县', id: '23'},
                            {text: '东阿县', id: '24'},
                            {text: '冠县', id: '25'},
                            {text: '高唐县', id: '26'},
                            {text: '临清市', id: '27'}
                        ]
                    },
                    {
                        text: '滨州市',
                        id: '16',
                        city: [
                            {text: '滨城区', id: '02'},
                            {text: '惠民县', id: '21'},
                            {text: '阳信县', id: '22'},
                            {text: '无棣县', id: '23'},
                            {text: '沾化县', id: '24'},
                            {text: '博兴县', id: '25'},
                            {text: '邹平县', id: '26'}
                        ]
                    },
                    {
                        text: '菏泽市',
                        id: '17',
                        city: [
                            {text: '牡丹区', id: '02'},
                            {text: '曹县', id: '21'},
                            {text: '单县', id: '22'},
                            {text: '成武县', id: '23'},
                            {text: '巨野县', id: '24'},
                            {text: '郓城县', id: '25'},
                            {text: '鄄城县', id: '26'},
                            {text: '定陶县', id: '27'},
                            {text: '东明县', id: '28'}
                        ]
                    }
                ]

            },
            {

                text: '河南省',
                id: '41',
                state: [
                    {
                        text: '郑州市',
                        id: '01',
                        city: [
                            {text: '中原区', id: '02'},
                            {text: '二七区', id: '03'},
                            {text: '管城回族区', id: '04'},
                            {text: '金水区', id: '05'},
                            {text: '上街区', id: '06'},
                            {text: '惠济区', id: '08'},
                            {text: '中牟县', id: '22'},
                            {text: '巩义市', id: '81'},
                            {text: '荥阳市', id: '82'},
                            {text: '新密市', id: '83'},
                            {text: '新郑市', id: '84'},
                            {text: '登封市', id: '85'}
                        ]
                    },
                    {
                        text: '开封市',
                        id: '02',
                        city: [
                            {text: '龙亭区', id: '02'},
                            {text: '顺河回族区', id: '03'},
                            {text: '鼓楼区', id: '04'},
                            {text: '禹王台区', id: '05'},
                            {text: '金明区', id: '11'},
                            {text: '杞县', id: '21'},
                            {text: '通许县', id: '22'},
                            {text: '尉氏县', id: '23'},
                            {text: '开封县', id: '24'},
                            {text: '兰考县', id: '25'}
                        ]
                    },
                    {
                        text: '洛阳市',
                        id: '03',
                        city: [
                            {text: '老城区', id: '02'},
                            {text: '西工区', id: '03'},
                            {text: '廛河回族区', id: '04'},
                            {text: '涧西区', id: '05'},
                            {text: '吉利区', id: '06'},
                            {text: '洛龙区', id: '07'},
                            {text: '孟津县', id: '22'},
                            {text: '新安县', id: '23'},
                            {text: '栾川县', id: '24'},
                            {text: '嵩县', id: '25'},
                            {text: '汝阳县', id: '26'},
                            {text: '宜阳县', id: '27'},
                            {text: '洛宁县', id: '28'},
                            {text: '伊川县', id: '29'},
                            {text: '偃师市', id: '81'}
                        ]
                    },
                    {
                        text: '平顶山市',
                        id: '04',
                        city: [
                            {text: '新华区', id: '02'},
                            {text: '卫东区', id: '03'},
                            {text: '石龙区', id: '04'},
                            {text: '湛河区', id: '11'},
                            {text: '宝丰县', id: '21'},
                            {text: '叶县', id: '22'},
                            {text: '鲁山县', id: '23'},
                            {text: '郏县', id: '25'},
                            {text: '舞钢市', id: '81'},
                            {text: '汝州市', id: '82'}
                        ]
                    },
                    {
                        text: '安阳市',
                        id: '05',
                        city: [
                            {text: '文峰区', id: '02'},
                            {text: '北关区', id: '03'},
                            {text: '殷都区', id: '05'},
                            {text: '龙安区', id: '06'},
                            {text: '安阳县', id: '22'},
                            {text: '汤阴县', id: '23'},
                            {text: '滑县', id: '26'},
                            {text: '内黄县', id: '27'},
                            {text: '林州市', id: '81'}
                        ]
                    },
                    {
                        text: '鹤壁市',
                        id: '06',
                        city: [
                            {text: '鹤山区', id: '02'},
                            {text: '山城区', id: '03'},
                            {text: '淇滨区', id: '11'},
                            {text: '浚县', id: '21'},
                            {text: '淇县', id: '22'}

                        ]
                    },
                    {
                        text: '新乡市',
                        id: '07',
                        city: [
                            {text: '红旗区', id: '02'},
                            {text: '卫滨区', id: '03'},
                            {text: '凤泉区', id: '04'},
                            {text: '牧野区', id: '11'},
                            {text: '新乡县', id: '21'},
                            {text: '获嘉县', id: '24'},
                            {text: '原阳县', id: '25'},
                            {text: '延津县', id: '26'},
                            {text: '封丘县', id: '27'},
                            {text: '长垣县', id: '28'},
                            {text: '卫辉市', id: '81'},
                            {text: '辉县市', id: '82'}
                        ]
                    },
                    {
                        text: '焦作市',
                        id: '08',
                        city: [
                            {text: '解放区', id: '02'},
                            {text: '中站区', id: '03'},
                            {text: '马村区', id: '04'},
                            {text: '山阳区', id: '11'},
                            {text: '修武县', id: '21'},
                            {text: '博爱县', id: '22'},
                            {text: '武陟县', id: '23'},
                            {text: '温县', id: '25'},
                            {text: '济源市', id: '81'},
                            {text: '沁阳市', id: '82'},
                            {text: '孟州市', id: '83'}
                        ]
                    },
                    {
                        text: '濮阳市',
                        id: '09',
                        city: [
                            {text: '华龙区', id: '02'},
                            {text: '清丰县', id: '22'},
                            {text: '南乐县', id: '23'},
                            {text: '范县', id: '26'},
                            {text: '台前县', id: '27'},
                            {text: '濮阳县', id: '28'}
                        ]
                    },
                    {
                        text: '许昌市',
                        id: '10',
                        city: [
                            {text: '魏都区', id: '02'},
                            {text: '许昌县', id: '23'},
                            {text: '鄢陵县', id: '24'},
                            {text: '襄城县', id: '25'},
                            {text: '禹州市', id: '81'},
                            {text: '长葛市', id: '82'}
                        ]
                    },
                    {
                        text: '漯河市',
                        id: '11',
                        city: [
                            {text: '源汇区', id: '02'},
                            {text: '郾城区', id: '03'},
                            {text: '召陵区', id: '04'},
                            {text: '舞阳县', id: '21'},
                            {text: '临颍县', id: '22'}
                        ]
                    },
                    {
                        text: '三门峡市',
                        id: '12',
                        city: [
                            {text: '湖滨区', id: '02'},
                            {text: '渑池县', id: '21'},
                            {text: '陕县', id: '22'},
                            {text: '卢氏县', id: '24'},
                            {text: '义马市', id: '81'},
                            {text: '灵宝市', id: '82'}
                        ]
                    },
                    {
                        text: '南阳市',
                        id: '13',
                        city: [
                            {text: '宛城区', id: '02'},
                            {text: '卧龙区', id: '03'},
                            {text: '南召县', id: '21'},
                            {text: '方城县', id: '22'},
                            {text: '西峡县', id: '23'},
                            {text: '镇平县', id: '24'},
                            {text: '内乡县', id: '25'},
                            {text: '淅川县', id: '26'},
                            {text: '社旗县', id: '27'},
                            {text: '唐河县', id: '28'},
                            {text: '新野县', id: '29'},
                            {text: '桐柏县', id: '30'},
                            {text: '邓州市', id: '81'}
                        ]
                    },
                    {
                        text: '商丘市',
                        id: '14',
                        city: [
                            {text: '梁园区', id: '02'},
                            {text: '睢阳区', id: '03'},
                            {text: '民权县', id: '21'},
                            {text: '睢县', id: '22'},
                            {text: '宁陵县', id: '23'},
                            {text: '柘城县', id: '24'},
                            {text: '虞城县', id: '25'},
                            {text: '夏邑县', id: '26'},
                            {text: '永城市', id: '81'}
                        ]
                    },
                    {
                        text: '信阳市',
                        id: '15',
                        city: [
                            {text: '浉河区', id: '02'},
                            {text: '平桥区', id: '03'},
                            {text: '罗山县', id: '21'},
                            {text: '光山县', id: '22'},
                            {text: '新县', id: '23'},
                            {text: '商城县', id: '24'},
                            {text: '固始县', id: '25'},
                            {text: '潢川县', id: '26'},
                            {text: '淮滨县', id: '27'},
                            {text: '息县', id: '28'}
                        ]
                    },
                    {
                        text: '周口市',
                        id: '16',
                        city: [
                            {text: '川汇区', id: '02'},
                            {text: '扶沟县', id: '21'},
                            {text: '西华县', id: '22'},
                            {text: '商水县', id: '23'},
                            {text: '沈丘县', id: '24'},
                            {text: '郸城县', id: '25'},
                            {text: '淮阳县', id: '26'},
                            {text: '太康县', id: '27'},
                            {text: '鹿邑县', id: '28'},
                            {text: '项城市', id: '81'}
                        ]
                    },
                    {
                        text: '驻马店市',
                        id: '17',
                        city: [
                            {text: '驿城区', id: '02'},
                            {text: '西平县', id: '21'},
                            {text: '上蔡县', id: '22'},
                            {text: '平舆县', id: '23'},
                            {text: '正阳县', id: '24'},
                            {text: '确山县', id: '25'},
                            {text: '泌阳县', id: '26'},
                            {text: '汝南县', id: '27'},
                            {text: '遂平县', id: '28'},
                            {text: '新蔡县', id: '29'}
                        ]
                    }
                ]

            },
            {

                text: '湖北省',
                id: '42',
                state: [
                    {
                        text: '武汉市',
                        id: '01',
                        city: [
                            {text: '江岸区', id: '02'},
                            {text: '江汉区', id: '03'},
                            {text: '硚口区', id: '04'},
                            {text: '汉阳区', id: '05'},
                            {text: '武昌区', id: '06'},
                            {text: '青山区', id: '07'},
                            {text: '洪山区', id: '11'},
                            {text: '东西湖区', id: '12'},
                            {text: '汉南区', id: '13'},
                            {text: '蔡甸区', id: '14'},
                            {text: '江夏区', id: '15'},
                            {text: '黄陂区', id: '16'},
                            {text: '新洲区', id: '17'}
                        ]
                    },
                    {
                        text: '黄石市',
                        id: '02',
                        city: [
                            {text: '黄石港区', id: '02'},
                            {text: '西塞山区', id: '03'},
                            {text: '下陆区', id: '04'},
                            {text: '铁山区', id: '05'},
                            {text: '阳新县', id: '22'},
                            {text: '大冶市', id: '81'}
                        ]
                    },
                    {
                        text: '十堰市',
                        id: '03',
                        city: [
                            {text: '茅箭区', id: '02'},
                            {text: '张湾区', id: '03'},
                            {text: '郧县', id: '21'},
                            {text: '郧西县', id: '22'},
                            {text: '竹山县', id: '23'},
                            {text: '竹溪县', id: '24'},
                            {text: '房县', id: '25'},
                            {text: '丹江口市', id: '81'}
                        ]
                    },
                    {
                        text: '宜昌市',
                        id: '05',
                        city: [
                            {text: '西陵区', id: '02'},
                            {text: '伍家岗区', id: '03'},
                            {text: '点军区', id: '04'},
                            {text: '猇亭区', id: '05'},
                            {text: '夷陵区', id: '06'},
                            {text: '远安县', id: '25'},
                            {text: '兴山县', id: '26'},
                            {text: '秭归县', id: '27'},
                            {text: '长阳土家族自治县', id: '28'},
                            {text: '五峰土家族自治县', id: '29'},
                            {text: '宜都市', id: '81'},
                            {text: '当阳市', id: '82'},
                            {text: '枝江市', id: '83'}
                        ]
                    },
                    {
                        text: '襄樊市',
                        id: '06',
                        city: [
                            {text: '襄城区', id: '02'},
                            {text: '樊城区', id: '06'},
                            {text: '襄阳区', id: '07'},
                            {text: '南漳县', id: '24'},
                            {text: '谷城县', id: '25'},
                            {text: '保康县', id: '26'},
                            {text: '老河口市', id: '82'},
                            {text: '枣阳市', id: '83'},
                            {text: '宜城市', id: '84'}
                        ]
                    },
                    {
                        text: '鄂州市',
                        id: '07',
                        city: [
                            {text: '梁子湖区', id: '02'},
                            {text: '华容区', id: '03'},
                            {text: '鄂城区', id: '04'}
                        ]
                    },
                    {
                        text: '荆门市',
                        id: '08',
                        city: [
                            {text: '东宝区', id: '02'},
                            {text: '掇刀区', id: '04'},
                            {text: '京山县', id: '21'},
                            {text: '沙洋县', id: '22'},
                            {text: '钟祥市', id: '81'}
                        ]
                    },
                    {
                        text: '孝感市',
                        id: '09',
                        city: [
                            {text: '孝南区', id: '02'},
                            {text: '孝昌县', id: '21'},
                            {text: '大悟县', id: '22'},
                            {text: '云梦县', id: '23'},
                            {text: '应城市', id: '81'},
                            {text: '安陆市', id: '82'},
                            {text: '汉川市', id: '84'}
                        ]
                    },
                    {
                        text: '荆州市',
                        id: '10',
                        city: [
                            {text: '沙市区', id: '02'},
                            {text: '荆州区', id: '03'},
                            {text: '公安县', id: '22'},
                            {text: '监利县', id: '23'},
                            {text: '江陵县', id: '24'},
                            {text: '石首市', id: '25'},
                            {text: '洪湖市', id: '83'},
                            {text: '松滋市', id: '87'}
                        ]
                    },
                    {
                        text: '黄冈市',
                        id: '11',
                        city: [
                            {text: '黄州区', id: '02'},
                            {text: '团风县', id: '21'},
                            {text: '红安县', id: '22'},
                            {text: '罗田县', id: '23'},
                            {text: '英山县', id: '24'},
                            {text: '浠水县', id: '25'},
                            {text: '蕲春县', id: '26'},
                            {text: '黄梅县', id: '27'},
                            {text: '麻城市', id: '81'},
                            {text: '武穴市', id: '82'}
                        ]
                    },
                    {
                        text: '咸宁市',
                        id: '12',
                        city: [
                            {text: '咸安区', id: '02'},
                            {text: '嘉鱼县', id: '21'},
                            {text: '通城县', id: '22'},
                            {text: '崇阳县', id: '23'},
                            {text: '通山县', id: '24'},
                            {text: '赤壁市', id: '81'}
                        ]
                    },
                    {
                        text: '随州市',
                        id: '13',
                        city: [
                            {text: '曾都区', id: '02'},
                            {text: '广水市', id: '81'}
                        ]
                    },
                    {
                        text: '恩施土家族苗族自治州',
                        id: '28',
                        city: [
                            {text: '恩施市', id: '01'},
                            {text: '利川市', id: '02'},
                            {text: '建始县', id: '22'},
                            {text: '巴东县', id: '23'},
                            {text: '宣恩县', id: '25'},
                            {text: '咸丰县', id: '26'},
                            {text: '来凤县', id: '27'},
                            {text: '鹤峰县', id: '28'}
                        ]
                    },
                    {
                        text: '直辖行政单位',
                        id: '90',
                        city: [
                            {text: '仙桃市', id: '04'},
                            {text: '潜江市', id: '05'},
                            {text: '天门市', id: '06'},
                            {text: '神农架林区', id: '21'}
                        ]
                    }
                ]
            },
            {

                text: '湖南省',
                id: '43',
                state: [
                    {
                        text: '长沙市',
                        id: '01',
                        city: [
                            {text: '芙蓉区', id: '02'},
                            {text: '天心区', id: '03'},
                            {text: '岳麓区', id: '04'},
                            {text: '开福区', id: '05'},
                            {text: '雨花区', id: '11'},
                            {text: '长沙县', id: '21'},
                            {text: '望城县', id: '22'},
                            {text: '宁乡县', id: '24'},
                            {text: '浏阳市', id: '81'}
                        ]
                    },
                    {
                        text: '株洲市',
                        id: '02',
                        city: [
                            {text: '荷塘区', id: '02'},
                            {text: '芦淞区', id: '03'},
                            {text: '石峰区', id: '04'},
                            {text: '天元区', id: '11'},
                            {text: '株洲县', id: '21'},
                            {text: '攸县', id: '23'},
                            {text: '茶陵县', id: '24'},
                            {text: '炎陵县', id: '25'},
                            {text: '醴陵市', id: '81'}
                        ]
                    },
                    {
                        text: '湘潭市',
                        id: '03',
                        city: [
                            {text: '雨湖区', id: '02'},
                            {text: '岳塘区', id: '04'},
                            {text: '湘潭县', id: '21'},
                            {text: '湘乡市', id: '81'},
                            {text: '韶山市', id: '82'}
                        ]
                    },
                    {
                        text: '衡阳市',
                        id: '04',
                        city: [
                            {text: '珠晖区', id: '05'},
                            {text: '雁峰区', id: '06'},
                            {text: '石鼓区', id: '07'},
                            {text: '蒸湘区', id: '08'},
                            {text: '南岳区', id: '12'},
                            {text: '衡阳县', id: '21'},
                            {text: '衡南县', id: '22'},
                            {text: '衡山县', id: '23'},
                            {text: '衡东县', id: '24'},
                            {text: '祁东县', id: '26'},
                            {text: '耒阳市', id: '81'},
                            {text: '常宁市', id: '82'}
                        ]
                    },
                    {
                        text: '邵阳市',
                        id: '05',
                        city: [
                            {text: '双清区', id: '02'},
                            {text: '大祥区', id: '03'},
                            {text: '北塔区', id: '11'},
                            {text: '邵东县', id: '21'},
                            {text: '新邵县', id: '22'},
                            {text: '邵阳县', id: '23'},
                            {text: '隆回县', id: '24'},
                            {text: '洞口县', id: '25'},
                            {text: '绥宁县', id: '27'},
                            {text: '新宁县', id: '28'},
                            {text: '城步苗族自治县', id: '29'},
                            {text: '武冈市', id: '81'}
                        ]
                    },
                    {
                        text: '岳阳市',
                        id: '06',
                        city: [
                            {text: '岳阳楼区', id: '02'},
                            {text: '云溪区', id: '03'},
                            {text: '君山区', id: '11'},
                            {text: '岳阳县', id: '21'},
                            {text: '华容县', id: '23'},
                            {text: '湘阴县', id: '24'},
                            {text: '平江县', id: '26'},
                            {text: '汨罗市', id: '81'},
                            {text: '临湘市', id: '82'}
                        ]
                    },
                    {
                        text: '常德市',
                        id: '07',
                        city: [
                            {text: '武陵区', id: '02'},
                            {text: '鼎城区', id: '03'},
                            {text: '安乡县', id: '21'},
                            {text: '汉寿县', id: '22'},
                            {text: '澧县', id: '23'},
                            {text: '临澧县', id: '24'},
                            {text: '桃源县', id: '25'},
                            {text: '石门县', id: '26'},
                            {text: '津市市', id: '81'}
                        ]
                    },
                    {
                        text: '张家界市',
                        id: '08',
                        city: [
                            {text: '永定区', id: '02'},
                            {text: '武陵源区', id: '11'},
                            {text: '慈利县', id: '21'},
                            {text: '桑植县', id: '22'}
                        ]
                    },
                    {
                        text: '益阳市',
                        id: '09',
                        city: [
                            {text: '资阳区', id: '02'},
                            {text: '赫山区', id: '03'},
                            {text: '南县', id: '21'},
                            {text: '桃江县', id: '22'},
                            {text: '安化县', id: '23'},
                            {text: '沅江市', id: '81'}
                        ]
                    },
                    {
                        text: '郴州市',
                        id: '10',
                        city: [
                            {text: '北湖区', id: '02'},
                            {text: '苏仙区', id: '03'},
                            {text: '桂阳县', id: '21'},
                            {text: '宜章县', id: '22'},
                            {text: '永兴县', id: '23'},
                            {text: '嘉禾县', id: '24'},
                            {text: '临武县', id: '25'},
                            {text: '汝城县', id: '26'},
                            {text: '桂东县', id: '27'},
                            {text: '安仁县', id: '28'},
                            {text: '资兴市', id: '81'}
                        ]
                    },
                    {
                        text: '永州市',
                        id: '11',
                        city: [
                            {text: '零陵区', id: '02'},
                            {text: '冷水滩区', id: '01'},
                            {text: '祁阳县', id: '21'},
                            {text: '东安县', id: '22'},
                            {text: '双牌县', id: '23'},
                            {text: '道县', id: '24'},
                            {text: '江永县', id: '25'},
                            {text: '宁远县', id: '26'},
                            {text: '蓝山县', id: '27'},
                            {text: '新田县', id: '28'},
                            {text: '江华瑶族自治县', id: '29'}
                        ]
                    },
                    {
                        text: '怀化市',
                        id: '12',
                        city: [
                            {text: '鹤城区', id: '02'},
                            {text: '中方县', id: '21'},
                            {text: '沅陵县', id: '22'},
                            {text: '辰溪县', id: '23'},
                            {text: '溆浦县', id: '24'},
                            {text: '会同县', id: '25'},
                            {text: '麻阳苗族自治县', id: '26'},
                            {text: '新晃侗族自治县', id: '27'},
                            {text: '芷江侗族自治县', id: '28'},
                            {text: '靖州苗族侗族自治县', id: '29'},
                            {text: '通道侗族自治县', id: '30'},
                            {text: '洪江市', id: '81'}
                        ]
                    },
                    {
                        text: '娄底市',
                        id: '13',
                        city: [
                            {text: '娄星区', id: '02'},
                            {text: '双峰县', id: '21'},
                            {text: '新化县', id: '22'},
                            {text: '冷水江市', id: '81'},
                            {text: '涟源市', id: '82'}
                        ]
                    },
                    {
                        text: '湘西土家族苗族自治州',
                        id: '31',
                        city: [
                            {text: '吉首市', id: '01'},
                            {text: '泸溪县', id: '22'},
                            {text: '凤凰县', id: '23'},
                            {text: '花垣县', id: '24'},
                            {text: '保靖县', id: '25'},
                            {text: '古丈县', id: '26'},
                            {text: '永顺县', id: '27'},
                            {text: '龙山县', id: '30'}
                        ]
                    }
                ]

            },
            {

                text: '广东省',
                id: '44',
                state: [
                    {
                        text: '广州市',
                        id: '01',
                        city: [
                            {text: '荔湾区', id: '03'},
                            {text: '越秀区', id: '04'},
                            {text: '海珠区', id: '05'},
                            {text: '天河区', id: '06'},
                            {text: '白云区', id: '11'},
                            {text: '黄埔区', id: '12'},
                            {text: '番禺区', id: '13'},
                            {text: '花都区', id: '14'},
                            {text: '南沙区', id: '15'},
                            {text: '萝岗区', id: '16'},
                            {text: '增城市', id: '83'},
                            {text: '从化市', id: '84'}
                        ]
                    },
                    {
                        text: '韶关市',
                        id: '02',
                        city: [
                            {text: '武江区', id: '03'},
                            {text: '浈江区', id: '04'},
                            {text: '曲江区', id: '05'},
                            {text: '始兴县', id: '22'},
                            {text: '仁化县', id: '24'},
                            {text: '翁源县', id: '29'},
                            {text: '乳源瑶族自治县', id: '32'},
                            {text: '新丰县', id: '33'},
                            {text: '乐昌市', id: '81'},
                            {text: '南雄市', id: '82'}
                        ]
                    },
                    {
                        text: '深圳市',
                        id: '03',
                        city: [
                            {text: '罗湖区', id: '03'},
                            {text: '福田区', id: '04'},
                            {text: '南山区', id: '05'},
                            {text: '宝安区', id: '06'},
                            {text: '龙岗区', id: '07'},
                            {text: '盐田区', id: '08'}
                        ]
                    },
                    {
                        text: '珠海市',
                        id: '04',
                        city: [
                            {text: '香洲区', id: '02'},
                            {text: '斗门区', id: '03'},
                            {text: '金湾区', id: '04'}
                        ]
                    },
                    {
                        text: '汕头市',
                        id: '05',
                        city: [
                            {text: '龙湖区', id: '07'},
                            {text: '金平区', id: '11'},
                            {text: '濠江区', id: '12'},
                            {text: '潮阳区', id: '13'},
                            {text: '潮南区', id: '14'},
                            {text: '澄海区', id: '15'},
                            {text: '南澳县', id: '23'}
                        ]
                    },
                    {
                        text: '佛山市',
                        id: '06',
                        city: [
                            {text: '禅城区', id: '04'},
                            {text: '南海区', id: '05'},
                            {text: '顺德区', id: '06'},
                            {text: '三水区', id: '07'},
                            {text: '高明区', id: '08'}
                        ]
                    },
                    {
                        text: '江门市',
                        id: '07',
                        city: [
                            {text: '蓬江区', id: '03'},
                            {text: '江海区', id: '04'},
                            {text: '新会区', id: '05'},
                            {text: '台山市', id: '81'},
                            {text: '开平市', id: '83'},
                            {text: '鹤山市', id: '84'},
                            {text: '恩平市', id: '85'}
                        ]
                    },
                    {
                        text: '湛江市',
                        id: '08',
                        city: [
                            {text: '赤坎区', id: '02'},
                            {text: '霞山区', id: '03'},
                            {text: '坡头区', id: '04'},
                            {text: '麻章区', id: '11'},
                            {text: '遂溪县', id: '23'},
                            {text: '徐闻县', id: '25'},
                            {text: '廉江市', id: '81'},
                            {text: '雷州市', id: '82'},
                            {text: '吴川市', id: '83'}
                        ]
                    },
                    {
                        text: '茂名市',
                        id: '09',
                        city: [
                            {text: '茂南区', id: '02'},
                            {text: '茂港区', id: '03'},
                            {text: '电白县', id: '23'},
                            {text: '高州市', id: '81'},
                            {text: '化州市', id: '82'},
                            {text: '信宜市', id: '83'}
                        ]
                    },
                    {
                        text: '肇庆市',
                        id: '12',
                        city: [
                            {text: '端州区', id: '02'},
                            {text: '鼎湖区', id: '03'},
                            {text: '广宁县', id: '23'},
                            {text: '怀集县', id: '24'},
                            {text: '封开县', id: '25'},
                            {text: '德庆县', id: '26'},
                            {text: '高要市', id: '83'},
                            {text: '四会市', id: '84'}
                        ]
                    },
                    {
                        text: '惠州市',
                        id: '13',
                        city: [
                            {text: '惠城区', id: '02'},
                            {text: '惠阳区', id: '03'},
                            {text: '博罗县', id: '22'},
                            {text: '惠东县', id: '23'},
                            {text: '龙门县', id: '24'}
                        ]
                    },
                    {
                        text: '梅州市',
                        id: '14',
                        city: [
                            {text: '梅江区', id: '02'},
                            {text: '梅县', id: '21'},
                            {text: '大埔县', id: '22'},
                            {text: '丰顺县', id: '23'},
                            {text: '五华县', id: '24'},
                            {text: '平远县', id: '26'},
                            {text: '蕉岭县', id: '27'},
                            {text: '兴宁市', id: '81'}
                        ]
                    },
                    {
                        text: '汕尾市',
                        id: '15',
                        city: [
                            {text: '城区', id: '02'},
                            {text: '海丰县', id: '21'},
                            {text: '陆河县', id: '22'},
                            {text: '陆丰市', id: '81'}
                        ]
                    },
                    {
                        text: '河源市',
                        id: '16',
                        city: [
                            {text: '源城区', id: '02'},
                            {text: '紫金县', id: '21'},
                            {text: '龙川县', id: '22'},
                            {text: '连平县', id: '23'},
                            {text: '和平县', id: '24'},
                            {text: '东源县', id: '25'}
                        ]
                    },
                    {
                        text: '阳江市',
                        id: '17',
                        city: [
                            {text: '江城区', id: '02'},
                            {text: '阳西县', id: '21'},
                            {text: '阳东县', id: '23'},
                            {text: '阳春市', id: '81'}
                        ]
                    },
                    {
                        text: '清远市',
                        id: '18',
                        city: [
                            {text: '清城区', id: '02'},
                            {text: '佛冈县', id: '21'},
                            {text: '阳山县', id: '23'},
                            {text: '连山壮族瑶族自治县', id: '25'},
                            {text: '连南瑶族自治县', id: '26'},
                            {text: '清新县', id: '27'},
                            {text: '英德市', id: '81'},
                            {text: '连州市', id: '82'}
                        ]
                    },
                    {
                        text: '东莞市',
                        id: '19',
                        city: [
                            {text: '市辖区', id: '01'}
                        ]
                    },
                    {
                        text: '中山市',
                        id: '20',
                        city: [
                            {text: '市辖区', id: '01'}
                        ]
                    },
                    {
                        text: '潮州市',
                        id: '51',
                        city: [
                            {text: '湘桥区', id: '02'},
                            {text: '潮安县', id: '21'},
                            {text: '饶平县', id: '22'}
                        ]
                    },
                    {
                        text: '揭阳市',
                        id: '52',
                        city: [
                            {text: '榕城区', id: '02'},
                            {text: '揭东县', id: '21'},
                            {text: '揭西县', id: '22'},
                            {text: '惠来县', id: '24'},
                            {text: '普宁市', id: '81'}
                        ]
                    },
                    {
                        text: '云浮市',
                        id: '53',
                        city: [
                            {text: '云城区', id: '02'},
                            {text: '新兴县', id: '21'},
                            {text: '郁南县', id: '22'},
                            {text: '云安县', id: '23'},
                            {text: '罗定市', id: '81'}
                        ]
                    }
                ]

            },
            {

                text: '广西',
                id: '45',
                state: [
                    {
                        text: '南宁市',
                        id: '01',
                        city: [
                            {text: '兴宁区', id: '02'},
                            {text: '青秀区', id: '03'},
                            {text: '江南区', id: '05'},
                            {text: '西乡塘区', id: '07'},
                            {text: '良庆区', id: '08'},
                            {text: '邕宁区', id: '09'},
                            {text: '武鸣县', id: '22'},
                            {text: '隆安县', id: '23'},
                            {text: '马山县', id: '24'},
                            {text: '上林县', id: '25'},
                            {text: '宾阳县', id: '26'},
                            {text: '横县', id: '27'}
                        ]
                    },
                    {
                        text: '柳州市',
                        id: '02',
                        city: [
                            {text: '城中区', id: '02'},
                            {text: '鱼峰区', id: '03'},
                            {text: '柳南区', id: '04'},
                            {text: '柳北区', id: '05'},
                            {text: '柳江县', id: '21'},
                            {text: '柳城县', id: '22'},
                            {text: '鹿寨县', id: '23'},
                            {text: '融安县', id: '24'},
                            {text: '融水苗族自治县', id: '25'},
                            {text: '三江侗族自治县', id: '26'}
                        ]
                    },
                    {
                        text: '桂林市',
                        id: '03',
                        city: [
                            {text: '秀峰区', id: '02'},
                            {text: '叠彩区', id: '03'},
                            {text: '象山区', id: '04'},
                            {text: '七星区', id: '05'},
                            {text: '雁山区', id: '11'},
                            {text: '阳朔县', id: '21'},
                            {text: '临桂县', id: '22'},
                            {text: '灵川县', id: '23'},
                            {text: '全州县', id: '24'},
                            {text: '兴安县', id: '25'},
                            {text: '永福县', id: '26'},
                            {text: '灌阳县', id: '27'},
                            {text: '龙胜各族自治县', id: '28'},
                            {text: '资源县', id: '29'},
                            {text: '平乐县', id: '30'},
                            {text: '荔蒲县', id: '31'},
                            {text: '恭城瑶族自治县', id: '32'}
                        ]
                    },
                    {
                        text: '梧州市',
                        id: '04',
                        city: [
                            {text: '万秀区', id: '03'},
                            {text: '蝶山区', id: '04'},
                            {text: '长洲区', id: '05'},
                            {text: '苍梧县', id: '21'},
                            {text: '藤县', id: '22'},
                            {text: '蒙山县', id: '23'},
                            {text: '岑溪市', id: '81'}
                        ]
                    },
                    {
                        text: '北海市',
                        id: '05',
                        city: [
                            {text: '海城区', id: '02'},
                            {text: '银海区', id: '03'},
                            {text: '铁山港区', id: '12'},
                            {text: '合浦县', id: '21'}
                        ]
                    },
                    {
                        text: '防城港市',
                        id: '06',
                        city: [
                            {text: '港口区', id: '02'},
                            {text: '防城区', id: '03'},
                            {text: '上思县', id: '21'},
                            {text: '东兴市', id: '81'}
                        ]
                    },
                    {
                        text: '钦州市',
                        id: '07',
                        city: [
                            {text: '钦南区', id: '02'},
                            {text: '钦北区', id: '03'},
                            {text: '灵山县', id: '21'},
                            {text: '浦北县', id: '22'}
                        ]
                    },
                    {
                        text: '贵港市',
                        id: '08',
                        city: [
                            {text: '港北区', id: '02'},
                            {text: '港南区', id: '03'},
                            {text: '覃塘区', id: '04'},
                            {text: '平南县', id: '21'},
                            {text: '桂平市', id: '81'}
                        ]
                    },
                    {
                        text: '玉林市',
                        id: '09',
                        city: [
                            {text: '玉州区', id: '02'},
                            {text: '容县', id: '21'},
                            {text: '陆川县', id: '22'},
                            {text: '博白县', id: '23'},
                            {text: '兴业县', id: '24'},
                            {text: '北流市', id: '81'}
                        ]
                    },
                    {
                        text: '百色市',
                        id: '10',
                        city: [
                            {text: '右江区', id: '02'},
                            {text: '田阳县', id: '21'},
                            {text: '田东县', id: '22'},
                            {text: '平果县', id: '23'},
                            {text: '德保县', id: '24'},
                            {text: '靖西县', id: '25'},
                            {text: '那坡县', id: '26'},
                            {text: '凌云县', id: '27'},
                            {text: '乐业县', id: '28'},
                            {text: '田林县', id: '29'},
                            {text: '西林县', id: '30'},
                            {text: '隆林各族自治县', id: '31'}
                        ]
                    },
                    {
                        text: '贺州市',
                        id: '11',
                        city: [
                            {text: '八步区', id: '02'},
                            {text: '昭平县', id: '21'},
                            {text: '钟山县', id: '22'},
                            {text: '富川瑶族自治县', id: '23'}
                        ]
                    },
                    {
                        text: '河池市',
                        id: '12',
                        city: [
                            {text: '金城江区', id: '02'},
                            {text: '南丹县', id: '21'},
                            {text: '天峨县', id: '22'},
                            {text: '凤山县', id: '23'},
                            {text: '东兰县', id: '24'},
                            {text: '罗城仫佬族自治县', id: '25'},
                            {text: '环江毛南族自治县', id: '26'},
                            {text: '巴马瑶族自治县', id: '27'},
                            {text: '都安瑶族自治县', id: '28'},
                            {text: '大化瑶族自治县', id: '29'},
                            {text: '宜州市', id: '81'}
                        ]
                    },
                    {
                        text: '来宾市',
                        id: '13',
                        city: [
                            {text: '兴宾区', id: '02'},
                            {text: '忻城县', id: '21'},
                            {text: '象州县', id: '22'},
                            {text: '武宣县', id: '23'},
                            {text: '金秀瑶族自治县', id: '24'},
                            {text: '合山市', id: '81'}
                        ]
                    },
                    {
                        text: '崇左市',
                        id: '14',
                        city: [
                            {text: '江洲区', id: '02'},
                            {text: '扶绥县', id: '21'},
                            {text: '宁明县', id: '22'},
                            {text: '龙州县', id: '23'},
                            {text: '大新县', id: '24'},
                            {text: '天等县', id: '25'},
                            {text: '凭祥市', id: '81'}
                        ]
                    }
                ]

            },
            {

                text: '海南省',
                id: '46',
                state: [
                    {
                        text: '海口市',
                        id: '01',
                        city: [
                            {text: '秀英区', id: '05'},
                            {text: '龙华区', id: '06'},
                            {text: '琼山区', id: '07'},
                            {text: '美兰区', id: '08'}
                        ]
                    },
                    {
                        text: '三亚市',
                        id: '02',
                        city: [
                            {text: '直辖县级行政单位', id: '90'},
                            {text: '五指山市', id: '01'},
                            {text: '琼海市', id: '02'},
                            {text: '儋州市', id: '03'},
                            {text: '文昌市', id: '05'},
                            {text: '万宁市', id: '06'},
                            {text: '东方市', id: '07'},
                            {text: '定安县', id: '25'},
                            {text: '屯昌县', id: '26'},
                            {text: '澄迈县', id: '27'},
                            {text: '临高县', id: '28'},
                            {text: '白沙黎族自治县', id: '30'},
                            {text: '昌江黎族自治县', id: '31'},
                            {text: '乐东黎族自治县', id: '33'},
                            {text: '陵水黎族自治县', id: '34'},
                            {text: '保亭黎族苗族自治县', id: '35'},
                            {text: '琼中黎族苗族自治县', id: '36'},
                            {text: '西沙群岛', id: '37'},
                            {text: '南沙群岛', id: '38'},
                            {text: '中沙群岛的岛礁及其海域', id: '39'}
                        ]
                    }
                ]

            },
            {

                text: '重庆',
                id: '50',
                state: [
                    {
                        text: '重庆市',
                        id: '01',
                        city: [
                            {text: '万州区', id: '01'},
                            {text: '涪陵区', id: '02'},
                            {text: '渝中区', id: '03'},
                            {text: '大渡口区', id: '04'},
                            {text: '江北区', id: '05'},
                            {text: '沙坪坝区', id: '06'},
                            {text: '九龙坡区', id: '07'},
                            {text: '南岸区', id: '08'},
                            {text: '北碚区', id: '09'},
                            {text: '万盛区', id: '10'},
                            {text: '双桥区', id: '11'},
                            {text: '渝北区', id: '12'},
                            {text: '巴南区', id: '13'},
                            {text: '黔江区', id: '14'},
                            {text: '长寿区', id: '15'},
                            {text: '江津区', id: '16'},
                            {text: '合川区', id: '17'},
                            {text: '永川区', id: '18'},
                            {text: '永川区', id: '19'}
                        ]
                    },
                    {
                        text: '县',
                        id: '02',
                        city: [
                            {text: '綦江县', id: '22'},
                            {text: '潼南县', id: '23'},
                            {text: '铜梁县', id: '24'},
                            {text: '大足县', id: '25'},
                            {text: '荣昌县', id: '26'},
                            {text: '璧山县', id: '27'},
                            {text: '梁平县', id: '28'},
                            {text: '城口县', id: '29'},
                            {text: '丰都县', id: '30'},
                            {text: '垫江县', id: '31'},
                            {text: '武隆县', id: '32'},
                            {text: '忠县', id: '33'},
                            {text: '开县', id: '34'},
                            {text: '云阳县', id: '35'},
                            {text: '奉节县', id: '36'},
                            {text: '巫山县', id: '37'},
                            {text: '巫溪县', id: '38'},
                            {text: '石柱土家族自治县', id: '40'},
                            {text: '秀山土家族苗族自治县', id: '41'},
                            {text: '酉阳土家族苗族自治县', id: '42'},
                            {text: '彭水苗族土家族自治县', id: '43'}
                        ]
                    }
                ]

            },
            {

                text: '四川省',
                id: '51',
                state: [
                    {
                        text: '成都市',
                        id: '01',
                        city: [
                            {text: '锦江区', id: '04'},
                            {text: '青羊区', id: '05'},
                            {text: '金牛区', id: '06'},
                            {text: '武侯区', id: '07'},
                            {text: '成华区', id: '08'},
                            {text: '龙泉驿区', id: '12'},
                            {text: '青白江区', id: '13'},
                            {text: '新都区', id: '14'},
                            {text: '温江区', id: '15'},
                            {text: '金堂县', id: '21'},
                            {text: '双流县', id: '22'},
                            {text: '郫县', id: '24'},
                            {text: '大邑县', id: '29'},
                            {text: '蒲江县', id: '31'},
                            {text: '新津县', id: '32'},
                            {text: '都江堰市', id: '81'},
                            {text: '彭州市', id: '82'},
                            {text: '邛崃市', id: '83'},
                            {text: '崇州市', id: '84'}
                        ]
                    },
                    {
                        text: '自贡市',
                        id: '03',
                        city: [
                            {text: '自流井区', id: '02'},
                            {text: '贡井区', id: '03'},
                            {text: '大安区', id: '04'},
                            {text: '沿滩区', id: '11'},
                            {text: '荣县', id: '21'},
                            {text: '富顺县', id: '22'}
                        ]
                    },
                    {
                        text: '攀枝花市',
                        id: '04',
                        city: [
                            {text: '东区', id: '02'},
                            {text: '西区', id: '03'},
                            {text: '仁和区', id: '11'},
                            {text: '米易县', id: '21'},
                            {text: '盐边县', id: '22'}
                        ]
                    },
                    {
                        text: '泸州市',
                        id: '05',
                        city: [
                            {text: '江阳区', id: '02'},
                            {text: '纳溪区', id: '03'},
                            {text: '龙马潭区', id: '04'},
                            {text: '泸县', id: '21'},
                            {text: '合江县', id: '22'},
                            {text: '叙永县', id: '24'},
                            {text: '古蔺县', id: '25'}
                        ]
                    },
                    {
                        text: '德阳市',
                        id: '06',
                        city: [
                            {text: '旌阳区', id: '02'},
                            {text: '中江县', id: '23'},
                            {text: '罗江县', id: '26'},
                            {text: '广汉市', id: '81'},
                            {text: '什邡市', id: '82'},
                            {text: '绵竹市', id: '83'}
                        ]
                    },
                    {
                        text: '绵阳市',
                        id: '07',
                        city: [
                            {text: '涪城区', id: '03'},
                            {text: '游仙区', id: '04'},
                            {text: '三台县', id: '22'},
                            {text: '盐亭县', id: '23'},
                            {text: '安县', id: '24'},
                            {text: '梓潼县', id: '25'},
                            {text: '北川羌族自治县', id: '26'},
                            {text: '平武县', id: '27'},
                            {text: '江油市', id: '28'}
                        ]
                    },
                    {
                        text: '广元市',
                        id: '08',
                        city: [
                            {text: '市中区', id: '02'},
                            {text: '元坝区', id: '11'},
                            {text: '朝天区', id: '12'},
                            {text: '旺苍县', id: '21'},
                            {text: '青川县', id: '22'},
                            {text: '剑阁县', id: '23'},
                            {text: '苍溪县', id: '24'}
                        ]
                    },
                    {
                        text: '遂宁市',
                        id: '09',
                        city: [
                            {text: '船山区', id: '03'},
                            {text: '安居区', id: '04'},
                            {text: '蓬溪县', id: '21'},
                            {text: '射洪县', id: '22'},
                            {text: '大英县', id: '23'}
                        ]
                    },
                    {
                        text: '内江市',
                        id: '10',
                        city: [
                            {text: '市中区', id: '02'},
                            {text: '东兴区', id: '11'},
                            {text: '威远县', id: '24'},
                            {text: '资中县', id: '25'},
                            {text: '隆昌县', id: '28'}
                        ]
                    },
                    {
                        text: '乐山市',
                        id: '11',
                        city: [
                            {text: '市中区', id: '02'},
                            {text: '沙湾区', id: '11'},
                            {text: '五通桥区', id: '12'},
                            {text: '金口河区', id: '13'},
                            {text: '犍为县', id: '23'},
                            {text: '井研县', id: '24'},
                            {text: '夹江县', id: '26'},
                            {text: '沐川县', id: '29'},
                            {text: '峨边彝族自治县', id: '32'},
                            {text: '马边彝族自治县', id: '33'},
                            {text: '峨眉山市', id: '81'}
                        ]
                    },
                    {
                        text: '南充市',
                        id: '13',
                        city: [
                            {text: '顺庆区', id: '02'},
                            {text: '高坪区', id: '03'},
                            {text: '嘉陵区', id: '04'},
                            {text: '南部县', id: '21'},
                            {text: '营山县', id: '22'},
                            {text: '蓬安县', id: '23'},
                            {text: '仪陇县', id: '24'},
                            {text: '西充县', id: '25'},
                            {text: '阆中市', id: '81'}
                        ]
                    },
                    {
                        text: '眉山市',
                        id: '14',
                        city: [
                            {text: '东坡区', id: '02'},
                            {text: '仁寿县', id: '21'},
                            {text: '彭山县', id: '22'},
                            {text: '洪雅县', id: '23'},
                            {text: '丹棱县', id: '24'},
                            {text: '青神县', id: '25'}
                        ]
                    },
                    {
                        text: '宜宾市',
                        id: '15',
                        city: [
                            {text: '翠屏区', id: '02'},
                            {text: '宜宾县', id: '21'},
                            {text: '南溪县', id: '22'},
                            {text: '江安县', id: '23'},
                            {text: '长宁县', id: '24'},
                            {text: '高县', id: '25'},
                            {text: '珙县', id: '26'},
                            {text: '筠连县', id: '27'},
                            {text: '兴文县', id: '28'},
                            {text: '屏山县', id: '29'}
                        ]
                    },
                    {
                        text: '广安市',
                        id: '16',
                        city: [
                            {text: '广安区', id: '02'},
                            {text: '岳池县', id: '21'},
                            {text: '武胜县', id: '22'},
                            {text: '邻水县', id: '23'},
                            {text: '华蓥市', id: '81'}
                        ]
                    },
                    {
                        text: '达州市',
                        id: '17',
                        city: [
                            {text: '通川区', id: '02'},
                            {text: '达县', id: '21'},
                            {text: '宣汉县', id: '22'},
                            {text: '开江县', id: '23'},
                            {text: '大竹县', id: '24'},
                            {text: '渠县', id: '25'},
                            {text: '万源市', id: '81'}
                        ]
                    },
                    {
                        text: '雅安市',
                        id: '18',
                        city: [
                            {text: '雨城区', id: '02'},
                            {text: '名山县', id: '21'},
                            {text: '荥经县', id: '22'},
                            {text: '汉源县', id: '23'},
                            {text: '石棉县', id: '24'},
                            {text: '天全县', id: '25'},
                            {text: '芦山县', id: '26'},
                            {text: '宝兴县', id: '27'}
                        ]
                    },
                    {
                        text: '巴中市',
                        id: '19',
                        city: [
                            {text: '巴州区', id: '02'},
                            {text: '通江县', id: '21'},
                            {text: '南江县', id: '22'},
                            {text: '平昌县', id: '23'}
                        ]
                    },
                    {
                        text: '资阳市',
                        id: '20',
                        city: [
                            {text: '雁江区', id: '02'},
                            {text: '安岳县', id: '21'},
                            {text: '乐至县', id: '22'},
                            {text: '简阳市', id: '23'}
                        ]
                    },
                    {
                        text: '阿坝藏族羌族自治州',
                        id: '32',
                        city: [
                            {text: '汶川县', id: '21'},
                            {text: '理县', id: '22'},
                            {text: '茂县', id: '23'},
                            {text: '松潘县', id: '24'},
                            {text: '九寨沟县', id: '25'},
                            {text: '金川县', id: '26'},
                            {text: '小金县', id: '27'},
                            {text: '黑水县', id: '28'},
                            {text: '马尔康县', id: '29'},
                            {text: '壤塘县', id: '30'},
                            {text: '阿坝县', id: '31'},
                            {text: '若尔盖县', id: '32'},
                            {text: '红原县', id: '33'}
                        ]
                    },
                    {
                        text: '甘孜藏族自治州',
                        id: '33',
                        city: [
                            {text: '康定县', id: '21'},
                            {text: '泸定县', id: '22'},
                            {text: '丹巴县', id: '23'},
                            {text: '九龙县', id: '24'},
                            {text: '雅江县', id: '25'},
                            {text: '道孚县', id: '26'},
                            {text: '炉霍县', id: '27'},
                            {text: '甘孜县', id: '28'},
                            {text: '新龙县', id: '29'},
                            {text: '德格县', id: '30'},
                            {text: '白玉县', id: '31'},
                            {text: '石渠县', id: '32'},
                            {text: '色达县', id: '33'},
                            {text: '理塘县', id: '34'},
                            {text: '巴塘县', id: '35'},
                            {text: '乡城县', id: '36'},
                            {text: '稻城县', id: '37'},
                            {text: '得荣县', id: '38'}
                        ]
                    },
                    {
                        text: '凉山彝族自治州',
                        id: '34',
                        city: [
                            {text: '西昌市', id: '01'},
                            {text: '木里藏族自治县', id: '22'},
                            {text: '盐源县', id: '23'},
                            {text: '德昌县', id: '24'},
                            {text: '会理县', id: '25'},
                            {text: '会东县', id: '26'},
                            {text: '宁南县', id: '27'},
                            {text: '普格县', id: '28'},
                            {text: '布拖县', id: '29'},
                            {text: '金阳县', id: '30'},
                            {text: '昭觉县', id: '31'},
                            {text: '喜德县', id: '32'},
                            {text: '冕宁县', id: '33'},
                            {text: '越西县', id: '34'},
                            {text: '甘洛县', id: '35'},
                            {text: '美姑县', id: '36'},
                            {text: '雷波县', id: '37'}
                        ]
                    }
                ]

            },
            {

                text: '贵州省',
                id: '52',
                state: [
                    {
                        text: '贵阳市',
                        id: '01',
                        city: [
                            {text: '南明区', id: '02'},
                            {text: '云岩区', id: '03'},
                            {text: '花溪区', id: '11'},
                            {text: '乌当区', id: '12'},
                            {text: '白云区', id: '13'},
                            {text: '小河区', id: '14'},
                            {text: '开阳县', id: '21'},
                            {text: '息烽县', id: '22'},
                            {text: '修文县', id: '23'},
                            {text: '清镇市', id: '81'}
                        ]
                    },
                    {
                        text: '六盘水市',
                        id: '02',
                        city: [
                            {text: '钟山区', id: '01'},
                            {text: '六枝特区', id: '03'},
                            {text: '水城县', id: '21'},
                            {text: '盘县', id: '22'}
                        ]
                    },
                    {
                        text: '遵义市',
                        id: '03',
                        city: [
                            {text: '红花岗区', id: '02'},
                            {text: '汇川区', id: '03'},
                            {text: '遵义县', id: '21'},
                            {text: '桐梓县', id: '22'},
                            {text: '绥阳县', id: '23'},
                            {text: '正安县', id: '24'},
                            {text: '道真仡佬族苗族自治县', id: '25'},
                            {text: '务川仡佬族苗族自治县', id: '26'},
                            {text: '凤冈县', id: '27'},
                            {text: '湄潭县', id: '28'},
                            {text: '余庆县', id: '29'},
                            {text: '习水县', id: '30'},
                            {text: '赤水市', id: '81'},
                            {text: '仁怀市', id: '82'}
                        ]
                    },
                    {
                        text: '安顺市',
                        id: '04',
                        city: [
                            {text: '西秀区', id: '02'},
                            {text: '平坝县', id: '21'},
                            {text: '普定县', id: '22'},
                            {text: '镇宁布依族苗族自治县', id: '23'},
                            {text: '关岭布依族苗族自治县', id: '24'},
                            {text: '紫云苗族布依族自治县', id: '25'}
                        ]
                    },
                    {
                        text: '铜仁地区',
                        id: '22',
                        city: [
                            {text: '铜仁市', id: '01'},
                            {text: '江口县', id: '22'},
                            {text: '玉屏侗族自治县', id: '23'},
                            {text: '石阡县', id: '24'},
                            {text: '思南县', id: '25'},
                            {text: '印江土家族苗族自治县', id: '26'},
                            {text: '德江县', id: '27'},
                            {text: '沿河土家族自治县', id: '28'},
                            {text: '松桃苗族自治县', id: '29'},
                            {text: '万山特区', id: '30'}
                        ]
                    },
                    {
                        text: '黔西南布依族苗族自治州',
                        id: '23',
                        city: [
                            {text: '兴义市', id: '01'},
                            {text: '兴仁县', id: '22'},
                            {text: '普安县', id: '23'},
                            {text: '晴隆县', id: '24'},
                            {text: '贞丰县', id: '25'},
                            {text: '望谟县', id: '26'},
                            {text: '册亨县', id: '27'},
                            {text: '安龙县', id: '28'}
                        ]
                    },
                    {
                        text: '毕节地区',
                        id: '24',
                        city: [
                            {text: '毕节市', id: '01'},
                            {text: '大方县', id: '22'},
                            {text: '黔西县', id: '23'},
                            {text: '金沙县', id: '24'},
                            {text: '织金县', id: '25'},
                            {text: '纳雍县', id: '26'},
                            {text: '威宁彝族回族苗族自治县', id: '27'},
                            {text: '赫章县', id: '28'}
                        ]
                    },
                    {
                        text: '黔东南苗族侗族自治州',
                        id: '26',
                        city: [
                            {text: '凯里市', id: '01'},
                            {text: '黄平县', id: '22'},
                            {text: '施秉县', id: '23'},
                            {text: '三穗县', id: '24'},
                            {text: '镇远县', id: '25'},
                            {text: '岑巩县', id: '26'},
                            {text: '天柱县', id: '27'},
                            {text: '锦屏县', id: '28'},
                            {text: '剑河县', id: '29'},
                            {text: '台江县', id: '30'},
                            {text: '黎平县', id: '31'},
                            {text: '榕江县', id: '32'},
                            {text: '从江县', id: '33'},
                            {text: '雷山县', id: '34'},
                            {text: '麻江县', id: '35'},
                            {text: '丹寨县', id: '36'}
                        ]
                    },
                    {
                        text: '黔南布依族苗族自治州',
                        id: '27',
                        city: [
                            {text: '都匀市', id: '01'},
                            {text: '福泉市', id: '02'},
                            {text: '荔波县', id: '22'},
                            {text: '贵定县', id: '23'},
                            {text: '瓮安县', id: '25'},
                            {text: '独山县', id: '26'},
                            {text: '平塘县', id: '27'},
                            {text: '罗甸县', id: '28'},
                            {text: '长顺县', id: '29'},
                            {text: '龙里县', id: '30'},
                            {text: '惠水县', id: '31'},
                            {text: '三都水族自治县', id: '32'}
                        ]
                    }
                ]

            },
            {

                text: '云南省',
                id: '53',
                state: [
                    {
                        text: '昆明市',
                        id: '01',
                        city: [
                            {text: '五华区', id: '02'},
                            {text: '盘龙区', id: '03'},
                            {text: '官渡区', id: '11'},
                            {text: '西山区', id: '12'},
                            {text: '东川区', id: '13'},
                            {text: '呈贡县', id: '21'},
                            {text: '晋宁县', id: '22'},
                            {text: '富民县', id: '24'},
                            {text: '宜良县', id: '25'},
                            {text: '石林彝族自治县', id: '26'},
                            {text: '嵩明县', id: '27'},
                            {text: '禄劝彝族苗族自治县', id: '28'},
                            {text: '寻甸回族彝族自治县', id: '29'},
                            {text: '安宁市', id: '81'}
                        ]
                    },
                    {
                        text: '曲靖市',
                        id: '03',
                        city: [
                            {text: '麒麟区', id: '02'},
                            {text: '马龙县', id: '21'},
                            {text: '陆良县', id: '22'},
                            {text: '师宗县', id: '23'},
                            {text: '罗平县', id: '24'},
                            {text: '富源县', id: '25'},
                            {text: '会泽县', id: '26'},
                            {text: '沾益县', id: '28'},
                            {text: '宣威市', id: '81'}
                        ]
                    },
                    {
                        text: '玉溪市',
                        id: '04',
                        city: [
                            {text: '红塔区', id: '02'},
                            {text: '江川县', id: '21'},
                            {text: '澄江县', id: '22'},
                            {text: '通海县', id: '23'},
                            {text: '华宁县', id: '24'},
                            {text: '易门县', id: '25'},
                            {text: '峨山彝族自治县', id: '26'},
                            {text: '新平彝族傣族自治县', id: '27'},
                            {text: '元江哈尼族彝族傣族自治县', id: '28'}
                        ]
                    },
                    {
                        text: '保山市',
                        id: '05',
                        city: [
                            {text: '隆阳区', id: '02'},
                            {text: '施甸县', id: '21'},
                            {text: '腾冲县', id: '22'},
                            {text: '龙陵县', id: '23'},
                            {text: '昌宁县', id: '24'}
                        ]
                    },
                    {
                        text: '昭通市',
                        id: '06',
                        city: [
                            {text: '昭阳区', id: '02'},
                            {text: '鲁甸县', id: '21'},
                            {text: '巧家县', id: '22'},
                            {text: '盐津县', id: '23'},
                            {text: '大关县', id: '25'},
                            {text: '永善县', id: '25'},
                            {text: '绥江县', id: '26'},
                            {text: '镇雄县', id: '27'},
                            {text: '彝良县', id: '28'},
                            {text: '威信县', id: '29'},
                            {text: '水富县', id: '30'}
                        ]
                    },
                    {
                        text: '丽江市',
                        id: '07',
                        city: [
                            {text: '古城区', id: '02'},
                            {text: '玉龙纳西族自治县', id: '21'},
                            {text: '永胜县', id: '22'},
                            {text: '华坪县', id: '23'},
                            {text: '宁蒗彝族自治县', id: '24'}
                        ]
                    },
                    {
                        text: '思茅市',
                        id: '08',
                        city: [
                            {text: '翠云区', id: '02'},
                            {text: '普洱哈尼族彝族自治县', id: '21'},
                            {text: '墨江哈尼族自治县', id: '22'},
                            {text: '景东彝族自治县', id: '23'},
                            {text: '景谷傣族彝族自治县', id: '24'},
                            {text: '镇沅彝族哈尼族拉祜族自治县', id: '25'},
                            {text: '江城哈尼族彝族自治县', id: '26'},
                            {text: '孟连傣族拉祜族佤族自治县', id: '27'},
                            {text: '澜沧拉祜族自治县', id: '28'},
                            {text: '西盟佤族自治县', id: '29'}
                        ]
                    },
                    {
                        text: '临沧市',
                        id: '09',
                        city: [
                            {text: '临翔区', id: '02'},
                            {text: '凤庆县', id: '21'},
                            {text: '云县', id: '22'},
                            {text: '永德县', id: '23'},
                            {text: '镇康县', id: '24'},
                            {text: '双江拉祜族佤族布朗族傣族自治县', id: '25'},
                            {text: '耿马傣族佤族自治县', id: '26'},
                            {text: '沧源佤族自治县', id: '27'}
                        ]
                    },
                    {
                        text: '楚雄彝族自治州',
                        id: '23',
                        city: [
                            {text: '楚雄市', id: '01'},
                            {text: '双柏县', id: '22'},
                            {text: '牟定县', id: '23'},
                            {text: '南华县', id: '24'},
                            {text: '姚安县', id: '25'},
                            {text: '大姚县', id: '26'},
                            {text: '永仁县', id: '27'},
                            {text: '元谋县', id: '28'},
                            {text: '武定县', id: '29'},
                            {text: '禄丰县', id: '31'}
                        ]
                    },
                    {
                        text: '红河哈尼族彝族自治州',
                        id: '25',
                        city: [
                            {text: '个旧市', id: '01'},
                            {text: '开远市', id: '02'},
                            {text: '蒙自县', id: '22'},
                            {text: '屏边苗族自治县', id: '23'},
                            {text: '建水县', id: '24'},
                            {text: '石屏县', id: '25'},
                            {text: '弥勒县', id: '26'},
                            {text: '泸西县', id: '27'},
                            {text: '元阳县', id: '28'},
                            {text: '红河县', id: '29'},
                            {text: '金平苗族瑶族傣族自治县', id: '30'},
                            {text: '绿春县', id: '31'},
                            {text: '河口瑶族自治县', id: '32'}
                        ]
                    },
                    {
                        text: '文山壮族苗族自治州',
                        id: '26',
                        city: [
                            {text: '文山县', id: '21'},
                            {text: '砚山县', id: '22'},
                            {text: '西畴县', id: '23'},
                            {text: '麻栗坡县', id: '24'},
                            {text: '马关县', id: '25'},
                            {text: '丘北县', id: '26'},
                            {text: '广南县', id: '27'},
                            {text: '富宁县', id: '28'}
                        ]
                    },
                    {
                        text: '西双版纳傣族自治州',
                        id: '28',
                        city: [
                            {text: '景洪市', id: '01'},
                            {text: '勐海县', id: '22'},
                            {text: '勐腊县', id: '23'}
                        ]
                    },
                    {
                        text: '大理白族自治州',
                        id: '29',
                        city: [
                            {text: '大理市', id: '01'},
                            {text: '漾濞彝族自治县', id: '22'},
                            {text: '祥云县', id: '23'},
                            {text: '宾川县', id: '24'},
                            {text: '弥渡县', id: '25'},
                            {text: '南涧彝族自治县', id: '26'},
                            {text: '巍山彝族回族自治县', id: '27'},
                            {text: '永平县', id: '28'},
                            {text: '云龙县', id: '29'},
                            {text: '洱源县', id: '30'},
                            {text: '剑川县', id: '31'},
                            {text: '鹤庆县', id: '32'}
                        ]
                    },
                    {
                        text: '德宏傣族景颇族自治州',
                        id: '31',
                        city: [
                            {text: '瑞丽市', id: '02'},
                            {text: '潞西市', id: '03'},
                            {text: '梁河县', id: '22'},
                            {text: '盈江县', id: '23'},
                            {text: '陇川县', id: '24'}
                        ]
                    },
                    {
                        text: '怒江傈僳族自治州',
                        id: '33',
                        city: [
                            {text: '泸水县', id: '21'},
                            {text: '福贡县', id: '23'},
                            {text: '贡山独龙族怒族自治县', id: '24'},
                            {text: '兰坪白族普米族自治县', id: '25'}
                        ]
                    },
                    {
                        text: '迪庆藏族自治州',
                        id: '34',
                        city: [
                            {text: '香格里拉县', id: '21'},
                            {text: '德钦县', id: '22'},
                            {text: '维西傈僳族自治县', id: '23'}
                        ]
                    }
                ]

            },
            {

                text: '西藏',
                id: '54',
                state: [
                    {
                        text: '拉萨市',
                        id: '01',
                        city: [
                            {text: '城关区', id: '02'},
                            {text: '林周县', id: '21'},
                            {text: '当雄县', id: '22'},
                            {text: '尼木县', id: '23'},
                            {text: '曲水县', id: '24'},
                            {text: '堆龙德庆县', id: '25'},
                            {text: '达孜县', id: '26'},
                            {text: '墨竹工卡县', id: '27'}
                        ]
                    },
                    {
                        text: '昌都地区',
                        id: '21',
                        city: [
                            {text: '昌都县', id: '21'},
                            {text: '江达县', id: '22'},
                            {text: '贡觉县', id: '23'},
                            {text: '类乌齐县', id: '24'},
                            {text: '丁青县', id: '25'},
                            {text: '察雅县', id: '26'},
                            {text: '八宿县', id: '27'},
                            {text: '左贡县', id: '28'},
                            {text: '芒康县', id: '29'},
                            {text: '洛隆县', id: '32'},
                            {text: '边坝县', id: '33'}
                        ]
                    },
                    {
                        text: '山南地区',
                        id: '22',
                        city: [
                            {text: '乃东县', id: '21'},
                            {text: '扎囊县', id: '22'},
                            {text: '贡嘎县', id: '23'},
                            {text: '桑日县', id: '24'},
                            {text: '琼结县', id: '25'},
                            {text: '曲松县', id: '26'},
                            {text: '措美县', id: '27'},
                            {text: '洛扎县', id: '28'},
                            {text: '加查县', id: '29'},
                            {text: '隆子县', id: '31'},
                            {text: '错那县', id: '32'},
                            {text: '浪卡子县', id: '33'}

                        ]
                    },
                    {
                        text: '日喀则地区',
                        id: '23',
                        city: [
                            {text: '日喀则市', id: '01'},
                            {text: '南木林县', id: '22'},
                            {text: '江孜县', id: '23'},
                            {text: '定日县', id: '24'},
                            {text: '萨迦县', id: '25'},
                            {text: '拉孜县', id: '26'},
                            {text: '昂仁县', id: '27'},
                            {text: '谢通门县', id: '28'},
                            {text: '白朗县', id: '29'},
                            {text: '仁布县', id: '30'},
                            {text: '康马县', id: '31'},
                            {text: '定结县', id: '32'},
                            {text: '仲巴县', id: '33'},
                            {text: '亚东县', id: '34'},
                            {text: '吉隆县', id: '35'},
                            {text: '聂拉木县', id: '36'},
                            {text: '萨嘎县', id: '37'},
                            {text: '岗巴县', id: '38'}
                        ]
                    },
                    {
                        text: '那曲地区',
                        id: '24',
                        city: [
                            {text: '那曲县', id: '21'},
                            {text: '嘉黎县', id: '22'},
                            {text: '比如县', id: '23'},
                            {text: '聂荣县', id: '24'},
                            {text: '安多县', id: '25'},
                            {text: '申扎县', id: '26'},
                            {text: '索县', id: '27'},
                            {text: '班戈县', id: '28'},
                            {text: '巴青县', id: '29'},
                            {text: '尼玛县', id: '30'}
                        ]
                    },
                    {
                        text: '阿里地区',
                        id: '25',
                        city: [
                            {text: '普兰县', id: '21'},
                            {text: '札达县', id: '22'},
                            {text: '噶尔县', id: '23'},
                            {text: '日土县', id: '24'},
                            {text: '革吉县', id: '25'},
                            {text: '改则县', id: '26'},
                            {text: '措勤县', id: '27'}
                        ]
                    },
                    {
                        text: '林芝地区',
                        id: '26',
                        city: [
                            {text: '林芝县', id: '21'},
                            {text: '工布江达县', id: '22'},
                            {text: '米林县', id: '23'},
                            {text: '墨脱县', id: '24'},
                            {text: '波密县', id: '25'},
                            {text: '察隅县', id: '26'},
                            {text: '朗县', id: '27'}
                        ]
                    }
                ]

            },
            {

                text: '陕西省',
                id: '61',
                state: [
                    {
                        text: '西安市',
                        id: '01',
                        city: [
                            {text: '新城区', id: '02'},
                            {text: '碑林区', id: '03'},
                            {text: '莲湖区', id: '04'},
                            {text: '灞桥区', id: '11'},
                            {text: '未央区', id: '12'},
                            {text: '雁塔区', id: '13'},
                            {text: '阎良区', id: '14'},
                            {text: '临潼区', id: '15'},
                            {text: '长安区', id: '16'},
                            {text: '蓝田县', id: '22'},
                            {text: '周至县', id: '24'},
                            {text: '户县', id: '25'},
                            {text: '高陵县', id: '26'}
                        ]
                    },
                    {
                        text: '铜川市',
                        id: '02',
                        city: [
                            {text: '王益区', id: '02'},
                            {text: '印台区', id: '03'},
                            {text: '耀州区', id: '04'},
                            {text: '宜君县', id: '22'}
                        ]
                    },
                    {
                        text: '宝鸡市',
                        id: '03',
                        city: [
                            {text: '渭滨区', id: '02'},
                            {text: '金台区', id: '03'},
                            {text: '陈仓区', id: '04'},
                            {text: '凤翔县', id: '22'},
                            {text: '岐山县', id: '23'},
                            {text: '扶风县', id: '24'},
                            {text: '眉县', id: '26'},
                            {text: '陇县', id: '27'},
                            {text: '千阳县', id: '28'},
                            {text: '麟游县', id: '29'},
                            {text: '凤县', id: '30'},
                            {text: '太白县', id: '31'}

                        ]
                    },
                    {
                        text: '咸阳市',
                        id: '04',
                        city: [
                            {text: '秦都区', id: '02'},
                            {text: '杨凌区', id: '03'},
                            {text: '渭城区', id: '04'},
                            {text: '三原县', id: '22'},
                            {text: '泾阳县', id: '23'},
                            {text: '乾县', id: '24'},
                            {text: '礼泉县', id: '25'},
                            {text: '永寿县', id: '26'},
                            {text: '彬县', id: '27'},
                            {text: '长武县', id: '28'},
                            {text: '旬邑县', id: '29'},
                            {text: '淳化县', id: '30'},
                            {text: '武功县', id: '31'},
                            {text: '兴平市', id: '81'}
                        ]
                    },
                    {
                        text: '渭南市',
                        id: '05',
                        city: [
                            {text: '临渭区', id: '02'},
                            {text: '华县', id: '21'},
                            {text: '潼关县', id: '22'},
                            {text: '大荔县', id: '23'},
                            {text: '合阳县', id: '24'},
                            {text: '澄城县', id: '25'},
                            {text: '蒲城县', id: '26'},
                            {text: '白水县', id: '27'},
                            {text: '富平县', id: '28'},
                            {text: '韩城市', id: '81'},
                            {text: '华阴市', id: '82'}
                        ]
                    },
                    {
                        text: '延安市',
                        id: '06',
                        city: [
                            {text: '宝塔区', id: '02'},
                            {text: '延长县', id: '21'},
                            {text: '延川县', id: '22'},
                            {text: '子长县', id: '23'},
                            {text: '安塞县', id: '24'},
                            {text: '志丹县', id: '25'},
                            {text: '吴起县', id: '26'},
                            {text: '甘泉县', id: '27'},
                            {text: '富县', id: '28'},
                            {text: '洛川县', id: '29'},
                            {text: '宜川县', id: '30'},
                            {text: '黄龙县', id: '31'},
                            {text: '黄陵县', id: '32'}
                        ]
                    },
                    {
                        text: '汉中市',
                        id: '07',
                        city: [
                            {text: '汉台区', id: '02'},
                            {text: '南郑县', id: '21'},
                            {text: '城固县', id: '22'},
                            {text: '洋县', id: '23'},
                            {text: '西乡县', id: '24'},
                            {text: '勉县', id: '25'},
                            {text: '宁强县', id: '26'},
                            {text: '略阳县', id: '27'},
                            {text: '镇巴县', id: '28'},
                            {text: '留坝县', id: '29'},
                            {text: '佛坪县', id: '30'}
                        ]
                    },
                    {
                        text: '榆林市',
                        id: '08',
                        city: [
                            {text: '榆阳区', id: '02'},
                            {text: '神木县', id: '21'},
                            {text: '府谷县', id: '22'},
                            {text: '横山县', id: '23'},
                            {text: '靖边县', id: '24'},
                            {text: '定边县', id: '25'},
                            {text: '绥德县', id: '26'},
                            {text: '米脂县', id: '27'},
                            {text: '佳县', id: '28'},
                            {text: '吴堡县', id: '29'},
                            {text: '清涧县', id: '30'},
                            {text: '子洲县', id: '31'}
                        ]
                    },
                    {
                        text: '安康市',
                        id: '09',
                        city: [
                            {text: '汉滨区', id: '02'},
                            {text: '汉阴县', id: '21'},
                            {text: '石泉县', id: '22'},
                            {text: '宁陕县', id: '23'},
                            {text: '紫阳县', id: '24'},
                            {text: '岚皋县', id: '25'},
                            {text: '平利县', id: '26'},
                            {text: '镇坪县', id: '27'},
                            {text: '旬阳县', id: '28'},
                            {text: '白河县', id: '29'}
                        ]
                    },
                    {
                        text: '商洛市',
                        id: '10',
                        city: [
                            {text: '商州区', id: '02'},
                            {text: '洛南县', id: '21'},
                            {text: '丹凤县', id: '22'},
                            {text: '商南县', id: '23'},
                            {text: '山阳县', id: '24'},
                            {text: '镇安县', id: '25'},
                            {text: '柞水县', id: '26'}
                        ]
                    }
                ]

            },
            {

                text: '甘肃省',
                id: '62',
                state: [
                    {
                        text: '兰州市',
                        id: '01',
                        city: [
                            {text: '城关区', id: '02'},
                            {text: '七里河区', id: '03'},
                            {text: '西固区', id: '04'},
                            {text: '安宁区', id: '05'},
                            {text: '红古区', id: '11'},
                            {text: '永登县', id: '21'},
                            {text: '皋兰县', id: '22'},
                            {text: '榆中县', id: '23'}
                        ]
                    },
                    {
                        text: '嘉峪关市',
                        id: '02',
                        city: []
                    },
                    {
                        text: '金昌市',
                        id: '03',
                        city: [
                            {text: '金川区', id: '02'},
                            {text: '永昌县', id: '21'}
                        ]
                    },
                    {
                        text: '白银市',
                        id: '04',
                        city: [
                            {text: '白银区', id: '02'},
                            {text: '平川区', id: '03'},
                            {text: '靖远县', id: '21'},
                            {text: '会宁县', id: '22'},
                            {text: '景泰县', id: '23'}
                        ]
                    },
                    {
                        text: '天水市',
                        id: '05',
                        city: [
                            {text: '秦城区', id: '02'},
                            {text: '北道区', id: '03'},
                            {text: '清水县', id: '21'},
                            {text: '秦安县', id: '22'},
                            {text: '甘谷县', id: '23'},
                            {text: '武山县', id: '24'},
                            {text: '张家川回族自治县', id: '25'}
                        ]
                    },
                    {
                        text: '武威市',
                        id: '06',
                        city: [
                            {text: '凉州区', id: '02'},
                            {text: '民勤县', id: '21'},
                            {text: '古浪县', id: '22'},
                            {text: '天祝藏族自治县', id: '23'}
                        ]
                    },
                    {
                        text: '张掖市',
                        id: '07',
                        city: [
                            {text: '甘州区', id: '02'},
                            {text: '肃南裕固族自治县', id: '21'},
                            {text: '民乐县', id: '22'},
                            {text: '临泽县', id: '23'},
                            {text: '高台县', id: '24'},
                            {text: '山丹县', id: '25'}
                        ]
                    },
                    {
                        text: '平凉市',
                        id: '08',
                        city: [
                            {text: '崆峒区', id: '02'},
                            {text: '泾川县', id: '21'},
                            {text: '灵台县', id: '22'},
                            {text: '崇信县', id: '23'},
                            {text: '华亭县', id: '24'},
                            {text: '庄浪县', id: '25'},
                            {text: '静宁县', id: '26'}
                        ]
                    },
                    {
                        text: '酒泉市',
                        id: '09',
                        city: [
                            {text: '肃州区', id: '02'},
                            {text: '金塔县', id: '21'},
                            {text: '瓜州县', id: '22'},
                            {text: '肃北蒙古族自治县', id: '23'},
                            {text: '阿克塞哈萨克族自治县', id: '24'},
                            {text: '玉门市', id: '81'},
                            {text: '敦煌市', id: '82'}
                        ]
                    },
                    {
                        text: '庆阳市',
                        id: '10',
                        city: [
                            {text: '西峰区', id: '02'},
                            {text: '庆城县', id: '21'},
                            {text: '环县', id: '22'},
                            {text: '华池县', id: '23'},
                            {text: '合水县', id: '24'},
                            {text: '正宁县', id: '25'},
                            {text: '宁县', id: '26'},
                            {text: '镇原县', id: '27'}
                        ]
                    },
                    {
                        text: '定西市',
                        id: '11',
                        city: [
                            {text: '安定区', id: '02'},
                            {text: '通渭县', id: '21'},
                            {text: '陇西县', id: '22'},
                            {text: '渭源县', id: '23'},
                            {text: '临洮县', id: '24'},
                            {text: '漳县', id: '25'},
                            {text: '岷县', id: '26'}
                        ]
                    },
                    {
                        text: '陇南市',
                        id: '12',
                        city: [
                            {text: '武都区', id: '02'},
                            {text: '成县', id: '21'},
                            {text: '文县', id: '22'},
                            {text: '宕昌县', id: '23'},
                            {text: '康县', id: '24'},
                            {text: '西和县', id: '25'},
                            {text: '礼县', id: '26'},
                            {text: '徽县', id: '27'},
                            {text: '两当县', id: '28'}
                        ]
                    },
                    {
                        text: '临夏回族自治州',
                        id: '29',
                        city: [
                            {text: '临夏市', id: '01'},
                            {text: '临夏县', id: '21'},
                            {text: '康乐县', id: '22'},
                            {text: '永靖县', id: '23'},
                            {text: '广河县', id: '24'},
                            {text: '和政县', id: '25'},
                            {text: '东乡族自治县', id: '26'},
                            {text: '积石山保安族东乡族撒拉族自治县', id: '27'}
                        ]
                    },
                    {
                        text: '甘南藏族自治州',
                        id: '30',
                        city: [
                            {text: '合作市', id: '01'},
                            {text: '临潭县', id: '21'},
                            {text: '卓尼县', id: '22'},
                            {text: '舟曲县', id: '23'},
                            {text: '迭部县', id: '24'},
                            {text: '玛曲县', id: '25'},
                            {text: '碌曲县', id: '26'},
                            {text: '夏河县', id: '27'}
                        ]
                    }
                ]

            },
            {

                text: '青海',
                id: '63',
                state: [
                    {
                        text: '西宁市',
                        id: '01',
                        city: [
                            {text: '城东区', id: '02'},
                            {text: '城中区', id: '03'},
                            {text: '城西区', id: '04'},
                            {text: '城北区', id: '05'},
                            {text: '大通回族土族自治县', id: '21'},
                            {text: '湟中县', id: '22'},
                            {text: '湟源县', id: '23'}
                        ]
                    },
                    {
                        text: '海东地区',
                        id: '21',
                        city: [
                            {text: '平安县', id: '21'},
                            {text: '民和回族土族自治县', id: '22'},
                            {text: '乐都县', id: '23'},
                            {text: '互助土族自治县', id: '26'},
                            {text: '化隆回族自治县', id: '27'},
                            {text: '循化撒拉族自治县', id: '28'}
                        ]
                    },
                    {
                        text: '海北藏族自治州',
                        id: '22',
                        city: [
                            {text: '门源回族自治县', id: '21'},
                            {text: '祁连县', id: '22'},
                            {text: '海晏县', id: '23'},
                            {text: '刚察县', id: '24'}
                        ]
                    },
                    {
                        text: '黄南藏族自治州',
                        id: '23',
                        city: [
                            {text: '同仁县', id: '21'},
                            {text: '尖扎县', id: '22'},
                            {text: '泽库县', id: '23'},
                            {text: '河南蒙古族自治县', id: '24'}
                        ]
                    },
                    {
                        text: '海南藏族自治州',
                        id: '25',
                        city: [
                            {text: '共和县', id: '21'},
                            {text: '同德县', id: '22'},
                            {text: '贵德县', id: '23'},
                            {text: '兴海县', id: '24'},
                            {text: '贵南县', id: '25'}
                        ]
                    },
                    {
                        text: '果洛藏族自治州',
                        id: '26',
                        city: [
                            {text: '玛沁县', id: '21'},
                            {text: '班玛县', id: '22'},
                            {text: '甘德县', id: '23'},
                            {text: '达日县', id: '24'},
                            {text: '久治县', id: '25'},
                            {text: '玛多县', id: '26'}
                        ]
                    },
                    {
                        text: '玉树藏族自治州',
                        id: '27',
                        city: [
                            {text: '玉树县', id: '21'},
                            {text: '杂多县', id: '22'},
                            {text: '称多县', id: '23'},
                            {text: '治多县', id: '24'},
                            {text: '囊谦县', id: '25'},
                            {text: '曲麻莱县', id: '26'}
                        ]
                    },
                    {
                        text: '海西蒙古族藏族自治州',
                        id: '28',
                        city: [
                            {text: '格尔木市', id: '01'},
                            {text: '德令哈市', id: '02'},
                            {text: '乌兰县', id: '21'},
                            {text: '都兰县', id: '22'},
                            {text: '天峻县', id: '23'}
                        ]
                    }
                ]

            },
            {

                text: '宁夏',
                id: '64',
                state: [
                    {
                        text: '银川市',
                        id: '01',
                        city: [
                            {text: '兴庆区', id: '04'},
                            {text: '西夏区', id: '05'},
                            {text: '金凤区', id: '06'},
                            {text: '永宁县', id: '21'},
                            {text: '贺兰县', id: '22'},
                            {text: '灵武市', id: '81'}
                        ]
                    },
                    {
                        text: '石嘴山市',
                        id: '02',
                        city: [
                            {text: '大武口区', id: '02'},
                            {text: '惠农区', id: '05'},
                            {text: '平罗县', id: '21'}
                        ]
                    },
                    {
                        text: '吴忠市',
                        id: '03',
                        city: [
                            {text: '利通区', id: '02'},
                            {text: '盐池县', id: '23'},
                            {text: '同心县', id: '24'},
                            {text: '青铜峡市', id: '81'}
                        ]
                    },
                    {
                        text: '固原市',
                        id: '04',
                        city: [
                            {text: '原州区', id: '02'},
                            {text: '西吉县', id: '22'},
                            {text: '隆德县', id: '23'},
                            {text: '泾源县', id: '24'},
                            {text: '彭阳县', id: '25'}
                        ]
                    },
                    {
                        text: '中卫市',
                        id: '05',
                        city: [
                            {text: '沙坡头区', id: '02'},
                            {text: '中宁县', id: '21'},
                            {text: '海原县', id: '22'}
                        ]
                    }
                ]

            },
            {
                text: '新疆',
                id: '65',
                state: [
                    {
                        text: '乌鲁木齐市',
                        id: '01',
                        city: [
                            {text: '天山区', id: '02'},
                            {text: '沙依巴克区', id: '03'},
                            {text: '新市区', id: '04'},
                            {text: '水磨沟区', id: '05'},
                            {text: '头屯河区', id: '06'},
                            {text: '达坂城区', id: '07'},
                            {text: '东山区', id: '08'},
                            {text: '乌鲁木齐县', id: '21'}
                        ]
                    },
                    {
                        text: '克拉玛依市',
                        id: '02',
                        city: [
                            {text: '独山子区', id: '02'},
                            {text: '克拉玛依区', id: '03'},
                            {text: '白碱滩区', id: '04'},
                            {text: '乌尔禾区', id: '05'}
                        ]
                    },
                    {
                        text: '吐鲁番地区',
                        id: '21',
                        city: [
                            {text: '吐鲁番市', id: '01'},
                            {text: '鄯善县', id: '22'},
                            {text: '托克逊县', id: '23'}
                        ]
                    },
                    {
                        text: '哈密地区',
                        id: '22',
                        city: [
                            {text: '哈密市', id: '01'},
                            {text: '巴里坤哈萨克自治县', id: '22'},
                            {text: '伊吾县', id: '23'}
                        ]
                    },
                    {
                        text: '昌吉回族自治州',
                        id: '23',
                        city: [
                            {text: '昌吉市', id: '01'},
                            {text: '阜康市', id: '02'},
                            {text: '米泉市', id: '03'},
                            {text: '呼图壁县', id: '23'},
                            {text: '玛纳斯县', id: '24'},
                            {text: '奇台县', id: '25'},
                            {text: '吉木萨尔县', id: '27'},
                            {text: '木垒哈萨克自治县', id: '28'}
                        ]
                    },
                    {
                        text: '博尔塔拉蒙古自治州',
                        id: '27',
                        city: [
                            {text: '博乐市', id: '01'},
                            {text: '精河县', id: '22'},
                            {text: '温泉县', id: '23'}
                        ]
                    },
                    {
                        text: '巴音郭楞蒙古自治州',
                        id: '28',
                        city: [
                            {text: '库尔勒市', id: '01'},
                            {text: '轮台县', id: '22'},
                            {text: '尉犁县', id: '23'},
                            {text: '若羌县', id: '24'},
                            {text: '且末县', id: '25'},
                            {text: '焉耆回族自治县', id: '26'},
                            {text: '和静县', id: '27'},
                            {text: '和硕县', id: '28'},
                            {text: '博湖县', id: '29'}
                        ]
                    },
                    {
                        text: '阿克苏地区',
                        id: '29',
                        city: [
                            {text: '阿克苏市', id: '01'},
                            {text: '温宿县', id: '22'},
                            {text: '库车县', id: '23'},
                            {text: '沙雅县', id: '24'},
                            {text: '新和县', id: '25'},
                            {text: '拜城县', id: '26'},
                            {text: '乌什县', id: '27'},
                            {text: '阿瓦提县', id: '28'},
                            {text: '柯坪县', id: '29'}
                        ]
                    },
                    {
                        text: '克孜勒苏柯尔克孜自治州',
                        id: '30',
                        city: [
                            {text: '阿图什市', id: '01'},
                            {text: '阿克陶县', id: '22'},
                            {text: '阿合奇县', id: '23'},
                            {text: '乌恰县', id: '24'}
                        ]
                    },
                    {
                        text: '喀什地区',
                        id: '31',
                        city: [
                            {text: '喀什市', id: '01'},
                            {text: '疏附县', id: '21'},
                            {text: '疏勒县', id: '22'},
                            {text: '英吉沙县', id: '23'},
                            {text: '泽普县', id: '24'},
                            {text: '莎车县', id: '25'},
                            {text: '叶城县', id: '26'},
                            {text: '麦盖提县', id: '27'},
                            {text: '岳普湖县', id: '28'},
                            {text: '伽师县', id: '29'},
                            {text: '巴楚县', id: '30'},
                            {text: '塔什库尔干塔吉克自治县', id: '31'}
                        ]
                    },
                    {
                        text: '和田地区',
                        id: '32',
                        city: [
                            {text: '和田市', id: '01'},
                            {text: '和田县', id: '21'},
                            {text: '墨玉县', id: '22'},
                            {text: '皮山县', id: '23'},
                            {text: '洛浦县', id: '24'},
                            {text: '策勒县', id: '25'},
                            {text: '于田县', id: '26'},
                            {text: '民丰县', id: '27'}
                        ]
                    },
                    {
                        text: '伊犁哈萨克',
                        id: '40',
                        city: [
                            {text: '伊宁市', id: '02'},
                            {text: '奎屯市', id: '03'},
                            {text: '伊宁县', id: '21'},
                            {text: '察布查尔锡伯自治县', id: '22'},
                            {text: '霍城县', id: '23'},
                            {text: '巩留县', id: '24'},
                            {text: '新源县', id: '25'},
                            {text: '昭苏县', id: '26'},
                            {text: '特克斯县', id: '27'},
                            {text: '尼勒克县', id: '28'}
                        ]
                    },
                    {
                        text: '塔城地区',
                        id: '42',
                        city: [
                            {text: '塔城市', id: '01'},
                            {text: '乌苏市', id: '02'},
                            {text: '额敏县', id: '21'},
                            {text: '沙湾县', id: '23'},
                            {text: '托里县', id: '24'},
                            {text: '裕民县', id: '25'},
                            {text: '和布克赛尔蒙古自治县', id: '26'}
                        ]
                    },
                    {
                        text: '阿勒泰地区',
                        id: '43',
                        city: [
                            {text: '阿勒泰市', id: '01'},
                            {text: '布尔津县', id: '21'},
                            {text: '富蕴县', id: '22'},
                            {text: '福海县', id: '23'},
                            {text: '哈巴河县', id: '24'},
                            {text: '青河县', id: '25'},
                            {text: '吉木乃县', id: '26'}
                        ]
                    },
                    {
                        text: '石河子市',
                        id: '91',
                        city: []
                    },
                    {
                        text: '阿拉尔市',
                        id: '92',
                        city: []
                    },
                    {
                        text: '图木舒克市',
                        id: '93',
                        city: []
                    },
                    {
                        text: '五家渠市',
                        id: '94',
                        city: []
                    }
                ]

            }
        ]
        ;
    return {
        data: data
    }
})